{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "sys.path.append('..')\n",
    "from ddn_config import *\n",
    "from ddn_etl_utils import *\n",
    "from etl_es import *\n",
    "import datetime\n",
    "import hashlib\n",
    "\n",
    "from pyspark.sql.types import *\n",
    "from pyspark.sql import Row"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "start_time = '2018-07-27 19:05:00'\n",
    "end_time = '2018-07-27 19:20:59'\n",
    "\n",
    "read_label = True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def vpn_ip(ip):\n",
    "    if '172.' in ip:\n",
    "        return True\n",
    "    return False\n",
    "vpn_ip_udf = udf(vpn_ip, BooleanType())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "spark = SparkSession.builder.getOrCreate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "node_schema = ['type', 'node_id', 'node_ip', 'node_attr', 'ddn_id']\n",
    "edge_schema = ['from_id', 'to_id', 'proto', 'ddn_id', 'application', 'direction', 'total_bytes']\n",
    "\n",
    "# the schema for matching labels with existing ddn\n",
    "# category supports : 1. user; 2. application\n",
    "# role: will be used as ddn id\n",
    "# ids: for user, this list is ip list, for application, this list will be application key works within URI\n",
    "label_schema = ['category', 'role', 'ids']\n",
    "\n",
    "web_portal = ['192.168.7.100', '192.168.8.100']\n",
    "sql_portal = ['192.168.8.74', '192.168.8.155']\n",
    "\n",
    "#TODO: figure out an algorithm to detect multi-homed machines\n",
    "multi_homed_machine = [['192.168.7.100', \n",
    "                        '192.168.8.100']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "multi_homed_machine_dict = {'192.168.7.100': 'web',\n",
    "                            '192.168.8.100': 'web'}\n",
    "rows = []\n",
    "for ip in web_portal:\n",
    "    row_dict = {}\n",
    "    row_dict['type'] = 'application'\n",
    "    row_dict['node_id'] = multi_homed_machine_dict[ip]\n",
    "    row_dict['node_ip'] = ip\n",
    "    row_dict['node_attr'] = ' '\n",
    "    row_dict['ddn_id'] = 'default_pii'\n",
    "    rows.append(Row(**row_dict))\n",
    "sc = spark.sparkContext\n",
    "web_nodes = sc.parallelize(rows).toDF().select(node_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "interested_ip = web_portal + sql_portal\n",
    "interested_ip\n",
    "def in_list(ip):\n",
    "    return ip in interested_ip\n",
    "in_list_udf = udf(in_list, BooleanType())\n",
    "\n",
    "def multihomed_ip(ip):\n",
    "    for machine in multi_homed_machine:\n",
    "        if ip in machine:\n",
    "            return ','.join(machine)\n",
    "    return None\n",
    "multihomed_ip_udf = udf(multihomed_ip, StringType())\n",
    "\n",
    "def filter_intenal_ip(ip):\n",
    "    if ip is None:\n",
    "        return False\n",
    "    return '192.168' in ip\n",
    "filter_internal_ip_udf = udf(filter_intenal_ip, BooleanType())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "time_resolution = 300 # in secs, 5min\n",
    "def float_to_datetime(seconds):\n",
    "    if seconds is None:\n",
    "        return 0.0\n",
    "    return float(seconds)\n",
    "sec_to_dt_udf = udf(float_to_datetime, DoubleType())\n",
    "\n",
    "def ts_to_float(str):\n",
    "    from dateutil.parser import parse\n",
    "    if str is None:\n",
    "        return 0.0\n",
    "    dt = parse(str)\n",
    "    return dt.timestamp()\n",
    "ts_to_float_udf = udf(ts_to_float, DoubleType())\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "GET http://192.168.7.25:9200/tds/_search?size=10000 [status:404 request:0.010s]\n",
      "GET http://192.168.7.25:9200/tds_sqlbatch/_search?size=10000 [status:404 request:0.004s]\n",
      "GET http://192.168.7.25:9200/tds_tds7login/_search?size=10000 [status:404 request:0.004s]\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Reading index tds error from ES\n",
      "Reading index tds_sqlbatch error from ES\n",
      "Reading index tds_tds7login error from ES\n",
      "Reading index fuzzy error from ES\n"
     ]
    },
    {
     "ename": "AnalysisException",
     "evalue": "\"cannot resolve '`sha1`' given input columns: [container, @version, parent, filename, hash, @timestamp];;\\n'Project [container#697, filename#698, hash#699, 'sha1]\\n+- AnalysisBarrier\\n      +- Project [_source#688.@timestamp AS @timestamp#695, _source#688.@version AS @version#696, _source#688.container AS container#697, _source#688.filename AS filename#698, _source#688.hash AS hash#699, _source#688.parent AS parent#700]\\n         +- LogicalRDD [_id#685, _index#686, _score#687, _source#688, _type#689], false\\n\"",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mPy4JJavaError\u001b[0m                             Traceback (most recent call last)",
      "\u001b[0;32m~/anaconda3/lib/python3.6/site-packages/pyspark/sql/utils.py\u001b[0m in \u001b[0;36mdeco\u001b[0;34m(*a, **kw)\u001b[0m\n\u001b[1;32m     62\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 63\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkw\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     64\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mpy4j\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mprotocol\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mPy4JJavaError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/lib/python3.6/site-packages/py4j/protocol.py\u001b[0m in \u001b[0;36mget_return_value\u001b[0;34m(answer, gateway_client, target_id, name)\u001b[0m\n\u001b[1;32m    327\u001b[0m                     \u001b[0;34m\"An error occurred while calling {0}{1}{2}.\\n\"\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 328\u001b[0;31m                     format(target_id, \".\", name), value)\n\u001b[0m\u001b[1;32m    329\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mPy4JJavaError\u001b[0m: An error occurred while calling o413.select.\n: org.apache.spark.sql.AnalysisException: cannot resolve '`sha1`' given input columns: [container, @version, parent, filename, hash, @timestamp];;\n'Project [container#697, filename#698, hash#699, 'sha1]\n+- AnalysisBarrier\n      +- Project [_source#688.@timestamp AS @timestamp#695, _source#688.@version AS @version#696, _source#688.container AS container#697, _source#688.filename AS filename#698, _source#688.hash AS hash#699, _source#688.parent AS parent#700]\n         +- LogicalRDD [_id#685, _index#686, _score#687, _source#688, _type#689], false\n\n\tat org.apache.spark.sql.catalyst.analysis.package$AnalysisErrorAt.failAnalysis(package.scala:42)\n\tat org.apache.spark.sql.catalyst.analysis.CheckAnalysis$$anonfun$checkAnalysis$1$$anonfun$apply$2.applyOrElse(CheckAnalysis.scala:88)\n\tat org.apache.spark.sql.catalyst.analysis.CheckAnalysis$$anonfun$checkAnalysis$1$$anonfun$apply$2.applyOrElse(CheckAnalysis.scala:85)\n\tat org.apache.spark.sql.catalyst.trees.TreeNode$$anonfun$transformUp$1.apply(TreeNode.scala:289)\n\tat org.apache.spark.sql.catalyst.trees.TreeNode$$anonfun$transformUp$1.apply(TreeNode.scala:289)\n\tat org.apache.spark.sql.catalyst.trees.CurrentOrigin$.withOrigin(TreeNode.scala:70)\n\tat org.apache.spark.sql.catalyst.trees.TreeNode.transformUp(TreeNode.scala:288)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan$$anonfun$transformExpressionsUp$1.apply(QueryPlan.scala:95)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan$$anonfun$transformExpressionsUp$1.apply(QueryPlan.scala:95)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan$$anonfun$1.apply(QueryPlan.scala:107)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan$$anonfun$1.apply(QueryPlan.scala:107)\n\tat org.apache.spark.sql.catalyst.trees.CurrentOrigin$.withOrigin(TreeNode.scala:70)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan.transformExpression$1(QueryPlan.scala:106)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan.org$apache$spark$sql$catalyst$plans$QueryPlan$$recursiveTransform$1(QueryPlan.scala:118)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan$$anonfun$org$apache$spark$sql$catalyst$plans$QueryPlan$$recursiveTransform$1$1.apply(QueryPlan.scala:122)\n\tat scala.collection.TraversableLike$$anonfun$map$1.apply(TraversableLike.scala:234)\n\tat scala.collection.TraversableLike$$anonfun$map$1.apply(TraversableLike.scala:234)\n\tat scala.collection.mutable.ResizableArray$class.foreach(ResizableArray.scala:59)\n\tat scala.collection.mutable.ArrayBuffer.foreach(ArrayBuffer.scala:48)\n\tat scala.collection.TraversableLike$class.map(TraversableLike.scala:234)\n\tat scala.collection.AbstractTraversable.map(Traversable.scala:104)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan.org$apache$spark$sql$catalyst$plans$QueryPlan$$recursiveTransform$1(QueryPlan.scala:122)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan$$anonfun$2.apply(QueryPlan.scala:127)\n\tat org.apache.spark.sql.catalyst.trees.TreeNode.mapProductIterator(TreeNode.scala:187)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan.mapExpressions(QueryPlan.scala:127)\n\tat org.apache.spark.sql.catalyst.plans.QueryPlan.transformExpressionsUp(QueryPlan.scala:95)\n\tat org.apache.spark.sql.catalyst.analysis.CheckAnalysis$$anonfun$checkAnalysis$1.apply(CheckAnalysis.scala:85)\n\tat org.apache.spark.sql.catalyst.analysis.CheckAnalysis$$anonfun$checkAnalysis$1.apply(CheckAnalysis.scala:80)\n\tat org.apache.spark.sql.catalyst.trees.TreeNode.foreachUp(TreeNode.scala:127)\n\tat org.apache.spark.sql.catalyst.analysis.CheckAnalysis$class.checkAnalysis(CheckAnalysis.scala:80)\n\tat org.apache.spark.sql.catalyst.analysis.Analyzer.checkAnalysis(Analyzer.scala:92)\n\tat org.apache.spark.sql.catalyst.analysis.Analyzer.executeAndCheck(Analyzer.scala:105)\n\tat org.apache.spark.sql.execution.QueryExecution.analyzed$lzycompute(QueryExecution.scala:57)\n\tat org.apache.spark.sql.execution.QueryExecution.analyzed(QueryExecution.scala:55)\n\tat org.apache.spark.sql.execution.QueryExecution.assertAnalyzed(QueryExecution.scala:47)\n\tat org.apache.spark.sql.Dataset$.ofRows(Dataset.scala:74)\n\tat org.apache.spark.sql.Dataset.org$apache$spark$sql$Dataset$$withPlan(Dataset.scala:3296)\n\tat org.apache.spark.sql.Dataset.select(Dataset.scala:1307)\n\tat sun.reflect.GeneratedMethodAccessor16.invoke(Unknown Source)\n\tat sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)\n\tat java.lang.reflect.Method.invoke(Method.java:498)\n\tat py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:244)\n\tat py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:357)\n\tat py4j.Gateway.invoke(Gateway.java:282)\n\tat py4j.commands.AbstractCommand.invokeMethod(AbstractCommand.java:132)\n\tat py4j.commands.CallCommand.execute(CallCommand.java:79)\n\tat py4j.GatewayConnection.run(GatewayConnection.java:238)\n\tat java.lang.Thread.run(Thread.java:748)\n",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mAnalysisException\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-9-bcae61c9ee22>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0mend_time\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m'2018-07-27 19:20:59'\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m ddn = connect_ddn(start_time = start_time, \n\u001b[0;32m----> 4\u001b[0;31m                   end_time = end_time)\n\u001b[0m\u001b[1;32m      5\u001b[0m \u001b[0mddn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mddn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfilter\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcol\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'app'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m!=\u001b[0m\u001b[0;34m'dns'\u001b[0m\u001b[0;34m)\u001b[0m         \u001b[0;34m.\u001b[0m\u001b[0mrepartition\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m8\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      6\u001b[0m \u001b[0mfrom_ddn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mddn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfilter\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0min_list_udf\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"`id.orig_h`\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/helios/code/app/ddn/ddn_etl_utils.py\u001b[0m in \u001b[0;36mconnect_ddn\u001b[0;34m(start_time, end_time)\u001b[0m\n\u001b[1;32m    173\u001b[0m     \u001b[0mddn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mget_mysql_info\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mddn\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmysql_df\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    174\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 175\u001b[0;31m     \u001b[0mddn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mget_fuzzy_info\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mddn\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfuzzy_df\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    176\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    177\u001b[0m     \u001b[0mddn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mddn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdistinct\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/helios/code/app/ddn/ddn_etl_utils.py\u001b[0m in \u001b[0;36mget_fuzzy_info\u001b[0;34m(data, fuzzy_df)\u001b[0m\n\u001b[1;32m     95\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     96\u001b[0m \u001b[0;32mdef\u001b[0m \u001b[0mget_fuzzy_info\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfuzzy_df\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 97\u001b[0;31m     \u001b[0mfuzzy\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfuzzy_df\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mselect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mFUZZY_SAVE_COL\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     98\u001b[0m     \u001b[0mdata\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mjoin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfuzzy\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mFILE_SHA1_ID\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'left_outer'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     99\u001b[0m     \u001b[0;32mreturn\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/lib/python3.6/site-packages/pyspark/sql/dataframe.py\u001b[0m in \u001b[0;36mselect\u001b[0;34m(self, *cols)\u001b[0m\n\u001b[1;32m   1200\u001b[0m         \u001b[0;34m[\u001b[0m\u001b[0mRow\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mname\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34mu'Alice'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mage\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m12\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mRow\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mname\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34mu'Bob'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mage\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m15\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1201\u001b[0m         \"\"\"\n\u001b[0;32m-> 1202\u001b[0;31m         \u001b[0mjdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_jdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mselect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_jcols\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0mcols\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1203\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mDataFrame\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mjdf\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msql_ctx\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1204\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/lib/python3.6/site-packages/py4j/java_gateway.py\u001b[0m in \u001b[0;36m__call__\u001b[0;34m(self, *args)\u001b[0m\n\u001b[1;32m   1255\u001b[0m         \u001b[0manswer\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgateway_client\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend_command\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcommand\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1256\u001b[0m         return_value = get_return_value(\n\u001b[0;32m-> 1257\u001b[0;31m             answer, self.gateway_client, self.target_id, self.name)\n\u001b[0m\u001b[1;32m   1258\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1259\u001b[0m         \u001b[0;32mfor\u001b[0m \u001b[0mtemp_arg\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mtemp_args\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/lib/python3.6/site-packages/pyspark/sql/utils.py\u001b[0m in \u001b[0;36mdeco\u001b[0;34m(*a, **kw)\u001b[0m\n\u001b[1;32m     67\u001b[0m                                              e.java_exception.getStackTrace()))\n\u001b[1;32m     68\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0ms\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstartswith\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'org.apache.spark.sql.AnalysisException: '\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 69\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mAnalysisException\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0ms\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msplit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m': '\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstackTrace\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     70\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0ms\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstartswith\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'org.apache.spark.sql.catalyst.analysis'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     71\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mAnalysisException\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0ms\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msplit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m': '\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstackTrace\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mAnalysisException\u001b[0m: \"cannot resolve '`sha1`' given input columns: [container, @version, parent, filename, hash, @timestamp];;\\n'Project [container#697, filename#698, hash#699, 'sha1]\\n+- AnalysisBarrier\\n      +- Project [_source#688.@timestamp AS @timestamp#695, _source#688.@version AS @version#696, _source#688.container AS container#697, _source#688.filename AS filename#698, _source#688.hash AS hash#699, _source#688.parent AS parent#700]\\n         +- LogicalRDD [_id#685, _index#686, _score#687, _source#688, _type#689], false\\n\""
     ]
    }
   ],
   "source": [
    "start_time = '2018-07-27 19:05:00'\n",
    "end_time = '2018-07-27 19:20:59'\n",
    "ddn = connect_ddn(start_time = start_time, \n",
    "                  end_time = end_time)\n",
    "ddn = ddn.filter(col('app')!='dns')\\\n",
    "         .repartition(8)\n",
    "from_ddn = ddn.filter(in_list_udf(\"`id.orig_h`\"))\n",
    "to_ddn = ddn.filter(in_list_udf(\"`id.resp_h`\"))\n",
    "interested_ddn = from_ddn.union(to_ddn)\\\n",
    "                         .withColumn('ts_float', ts_to_float_udf('@timestamp'))\\\n",
    "                         .persist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "connection_schema = ['`id.orig_h`', '`id.orig_p`', '`id.resp_h`', '`id.resp_p`', '@timestamp', \n",
    "                     'ts_float', 'app', 'sqlbatch', 'arg', 'cmd', 'uri', 'proto', 'method', \n",
    "                     'orig_bytes', 'resp_bytes', 'uid', 'orig_sum_bytes', 'resp_sum_bytes']\n",
    "interested_ddn.distinct().count()\n",
    "\n",
    "# this will be used to derive \"edge\"\n",
    "all_connections = interested_ddn.select(connection_schema).distinct()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# the following block calculate db host, talbes, and column names\n",
    "SQL_COL = 'sql_query' # when sqlbatch works, update here\n",
    "def fill_sql_query(sqlbatch, arg):\n",
    "    if sqlbatch is None:\n",
    "        return arg\n",
    "    return sqlbatch\n",
    "fill_sql_query_udf = udf(fill_sql_query, StringType())\n",
    "\n",
    "def extract_table_column_sql(row):\n",
    "    sql = row[SQL_COL]\n",
    "    host = row['id.resp_h']   \n",
    "    key = host\n",
    "    table = ''\n",
    "    columns = []\n",
    "    if sql is None:\n",
    "        return (key, columns)\n",
    "    sql = sql.lower()\n",
    "    from_split = sql.split('from ')\n",
    "    if len(from_split) == 2:\n",
    "        where_split = from_split[1].split(' where ')\n",
    "        col_split = where_split[1].split(' =')\n",
    "        # tables.append(where_split[0])\n",
    "        table = where_split[0]\n",
    "        columns.append(col_split[0])\n",
    "    insert_split = sql.split('insert into ')\n",
    "    if len(insert_split) == 2:\n",
    "        #tables.append(insert_split[1].split(' ')[0])\n",
    "        table = insert_split[1].split(' ')[0]\n",
    "        columns.append('*') # all columns\n",
    "    return (key + ';' + table, columns)\n",
    "\n",
    "def gen_direction(sql, method):\n",
    "    if sql is not None:\n",
    "        sql = sql.lower()\n",
    "        if 'insert into' in sql:\n",
    "            return 'co'\n",
    "        if 'select' in sql:\n",
    "            return 'counter'\n",
    "    if method is not None:\n",
    "        method = method.lower()\n",
    "        if 'post' in method:\n",
    "            return 'co'\n",
    "        if 'get' in method:\n",
    "            return 'counter'\n",
    "    return None\n",
    "gen_direction_udf = udf(gen_direction, StringType())\n",
    "\n",
    "def gen_total_bytes(direction, orig_sum_bytes, resp_sum_bytes):\n",
    "    if orig_sum_bytes is None:\n",
    "        orig_sum_bytes = 0.0\n",
    "    if resp_sum_bytes is None:\n",
    "        resp_sum_bytes = 0.0\n",
    "    def _my_max(a, b):\n",
    "        if a >= b:\n",
    "            return a\n",
    "        return b\n",
    "    if direction is None:\n",
    "        return _my_max(orig_sum_bytes, resp_sum_bytes)\n",
    "    if direction == 'co':\n",
    "        return orig_sum_bytes\n",
    "    return resp_sum_bytes\n",
    "gen_total_bytes_udf = udf(gen_total_bytes, DoubleType())\n",
    "\n",
    "def combine_tables(x, y):\n",
    "    columns = set()\n",
    "    columns.update(x)\n",
    "    columns.update(y)\n",
    "    return list(columns)\n",
    "\n",
    "def process_table_col_to_row(pair):\n",
    "    host_table = pair[0]\n",
    "    tokens = host_table.split(';')\n",
    "    host = tokens[0]\n",
    "    table_name = None\n",
    "    if len(tokens) == 2:\n",
    "        table_name = tokens[1]\n",
    "    columns = pair[1]\n",
    "    \n",
    "    res = {}\n",
    "    res['db_host'] = host\n",
    "    res['tables'] = table_name\n",
    "    res['columns'] = columns\n",
    "    return Row(**res)\n",
    "    \n",
    "all_connections = all_connections.withColumn(SQL_COL, fill_sql_query_udf('sqlbatch', 'arg'))\\\n",
    "                                 .withColumn('direction', gen_direction_udf(SQL_COL, 'method'))\\\n",
    "                                 .withColumn('total_bytes', gen_total_bytes_udf('direction', 'orig_sum_bytes', 'resp_sum_bytes'))\n",
    "db_table_col = all_connections.filter(col(SQL_COL).isNotNull())\\\n",
    "                           .rdd.map(lambda row: extract_table_column_sql(row))\\\n",
    "                           .reduceByKey(lambda x, y: combine_tables(x, y))\\\n",
    "                           .map(lambda pair: process_table_col_to_row(pair))\\\n",
    "                           .toDF()\\\n",
    "                           .filter(col('tables')!='')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Calculate db node\n",
    "db_map = {\n",
    "    '192.168.8.74' : 'mysql',\n",
    "    '192.168.8.155': 'mssql'\n",
    "    }\n",
    "def generate_db_id(ip):\n",
    "    return db_map.get(ip)\n",
    "generate_db_id_udf = udf(generate_db_id, StringType())\n",
    "\n",
    "def generate_db_ip(ip):\n",
    "    return ip\n",
    "generate_db_ip_udf = udf(generate_db_ip, StringType())\n",
    "\n",
    "def generate_db_attr(columns, tables):\n",
    "    res = {}\n",
    "    res['columns'] = columns\n",
    "    res['tables'] = tables\n",
    "    return json.dumps(res)\n",
    "generate_db_attr_udf = udf(generate_db_attr, StringType())\n",
    "\n",
    "# node_schema = ['type', 'node_id', 'node_ip', 'node_attr', 'ddn_id']\n",
    "db_inter_df = db_table_col.withColumn('type', lit('database'))\\\n",
    "                        .withColumn('node_id', generate_db_id_udf('db_host'))\\\n",
    "                        .withColumn('node_ip', generate_db_ip_udf('db_host'))\\\n",
    "                        .withColumn('node_attr', generate_db_attr_udf('columns', 'tables'))\\\n",
    "                        .withColumn('ddn_id', lit('default_pii'))\n",
    "db_node = db_inter_df.select(node_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------+-------+-------------+--------------------+-----------+\n",
      "|    type|node_id|      node_ip|           node_attr|     ddn_id|\n",
      "+--------+-------+-------------+--------------------+-----------+\n",
      "|database|  mssql|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "|database|  mssql|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "|database|  mysql| 192.168.8.74|{\"columns\": [\"*\",...|default_pii|\n",
      "|database|  mysql| 192.168.8.74|{\"columns\": [\"eid...|default_pii|\n",
      "|database|  mssql|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "+--------+-------+-------------+--------------------+-----------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "db_node.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 289,
   "metadata": {},
   "outputs": [],
   "source": [
    "table_nodes = db_inter_df.drop('node_id')\\\n",
    "                        .withColumn('type', lit('table'))\\\n",
    "                       .withColumn('node_id', col('tables'))\\\n",
    "                       .select(node_schema)\n",
    "# ['from_id', 'to_id', 'proto', 'ddn_id', 'application', 'direction', 'total_bytes']\n",
    "table_edges = db_inter_df.withColumn('from_id', col('node_ip'))\\\n",
    "                        .withColumn('to_id', col('tables'))\\\n",
    "                        .withColumn('proto', lit('same_machine'))\\\n",
    "                        .withColumn('ddn_id', lit('default_pii'))\\\n",
    "                        .withColumn('application', lit(''))\\\n",
    "                        .withColumn('direction', lit('co'))\\\n",
    "                        .withColumn('total_bytes', lit(0))\\\n",
    "                        .select(edge_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----+-----------+-------------+--------------------+-----------+\n",
      "| type|    node_id|      node_ip|           node_attr|     ddn_id|\n",
      "+-----+-----------+-------------+--------------------+-----------+\n",
      "|table|   employee|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "|table|performance|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "|table|  customers| 192.168.8.74|{\"columns\": [\"*\",...|default_pii|\n",
      "|table|      sales| 192.168.8.74|{\"columns\": [\"eid...|default_pii|\n",
      "|table|    payment|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "+-----+-----------+-------------+--------------------+-----------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "table_nodes.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 202,
   "metadata": {},
   "outputs": [],
   "source": [
    "# the following block extracts application information\n",
    "application_cols = ['`id.orig_h`', '`id.orig_p`', '`id.resp_h`', '`id.resp_p`', 'application', 'proto', 'direction', 'total_bytes']\n",
    "known_applications = ['payroll', 'employee_info', 'customer', 'performance', 'sales']\n",
    "def extract_application_from_uri(uri):\n",
    "    if uri is None \\\n",
    "        or uri == '/' \\\n",
    "        or not uri.startswith('/'):\n",
    "        return 'unknown'\n",
    "    for known_app in known_applications:\n",
    "        if known_app in uri:\n",
    "            return known_app + \"_app\"\n",
    "    return 'unknown'\n",
    "#     tokens = uri.split('/')\n",
    "#     return tokens[1]\n",
    "application_udf = udf(extract_application_from_uri, StringType())\n",
    "\n",
    "def get_app_direction_from_uri(uri, direction):\n",
    "    if uri is None:\n",
    "        return None\n",
    "    if 'set' in uri:\n",
    "        return 'co'\n",
    "    if 'check' in uri:\n",
    "        return 'counter'\n",
    "    return direction\n",
    "get_app_direction_from_uri_udf = udf(get_app_direction_from_uri, StringType())\n",
    "\n",
    "def in_web_list(ip):\n",
    "    return ip in web_portal\n",
    "in_web_list_udf = udf(in_web_list, BooleanType())\n",
    "\n",
    "def in_sql_list(ip):\n",
    "    return ip in sql_portal\n",
    "in_sql_list_udf = udf(in_sql_list, BooleanType())\n",
    "\n",
    "user_to_app = all_connections.filter(in_web_list_udf('`id.resp_h`'))\\\n",
    "                                 .withColumn('application', application_udf('uri'))\\\n",
    "                                 .withColumn('direction', get_app_direction_from_uri_udf('uri', 'direction'))\\\n",
    "                                 .select(application_cols)\\\n",
    "                                 .distinct().filter(col('application')!='unknown')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "metadata": {},
   "outputs": [],
   "source": [
    "def app_gen_from_id(from_ip, port, application):\n",
    "    return application # from_ip + \":\" + port + '/' +\n",
    "app_gen_from_id_udf = udf(app_gen_from_id, StringType())\n",
    "\n",
    "# currently this is a placeholder\n",
    "def generate_app_attr(ip):\n",
    "    res = {}\n",
    "    res['ip'] = ip\n",
    "    return json.dumps(res)\n",
    "generate_app_attr_udf = udf(generate_app_attr, StringType())\n",
    "\n",
    "app_node = user_to_app.withColumn('type', lit('application'))\\\n",
    "                      .withColumn('node_id', app_gen_from_id_udf('`id.resp_h`', '`id.resp_p`', 'application'))\\\n",
    "                      .withColumn('node_ip', col('`id.resp_h`'))\\\n",
    "                      .withColumn('node_attr', generate_app_attr_udf('`id.resp_h`'))\\\n",
    "                      .withColumn('ddn_id', lit('default_pii'))\\\n",
    "                      .select(node_schema)\\\n",
    "                      .distinct()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "metadata": {},
   "outputs": [],
   "source": [
    "# calculate app to storage edge\n",
    "\n",
    "def app_gen_from_id(from_ip, port, application):\n",
    "    return from_ip# + \":\" + port + '/' + application\n",
    "app_gen_from_id_udf = udf(app_gen_from_id, StringType())\n",
    "\n",
    "def app_gen_to_id(orig_ip):\n",
    "    return orig_ip\n",
    "app_gen_to_id_udf = udf(app_gen_to_id, StringType())\n",
    "\n",
    "def gen_proto_port(port, proto):\n",
    "    return proto+\":\"+port\n",
    "gen_proto_port_udf = udf(gen_proto_port, StringType())\n",
    "\n",
    "# # this is a placeholder for application edge.\n",
    "# # currently it does NOT add any information\n",
    "# def app_gen_edge_attr(port, proto, total_bytes):\n",
    "#     res = {}\n",
    "#     res['port'] = port\n",
    "#     res['protocol'] = proto\n",
    "#     res['total_bytes'] = total_bytes\n",
    "#     return json.dumps(res)\n",
    "# app_gen_edge_attr_udf = udf(app_gen_edge_attr, StringType())\n",
    "\n",
    "app_to_db = all_connections.filter(in_sql_list_udf('`id.resp_h`'))\\\n",
    "                                 .withColumn('application', application_udf('uri'))\\\n",
    "                                 .select(application_cols)\\\n",
    "                                 .distinct()\n",
    "app_edge = app_to_db.withColumn('from_id', app_gen_from_id_udf('`id.orig_h`','`id.resp_p`','application'))\\\n",
    "                   .withColumn('to_id', app_gen_to_id_udf('`id.resp_h`'))\\\n",
    "                   .withColumn('ddn_id', lit('default_pii'))\\\n",
    "                   .select(edge_schema)\\\n",
    "                   .distinct()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "metadata": {},
   "outputs": [],
   "source": [
    "# the following block add user information to all the connections\n",
    "# known_users = {\n",
    "#     '192.168.7.130' : 'arthur',\n",
    "#     '192.168.7.171' : 'hua'\n",
    "# }\n",
    "def add_user(ip):\n",
    "    return ip\n",
    "#     if ip in known_users:\n",
    "#         return known_users[ip]\n",
    "#     return 'unknown'\n",
    "add_user_udf = udf(add_user, StringType())\n",
    "all_connections_with_app = all_connections.withColumn('application', application_udf('uri'))\n",
    "user_df = all_connections_with_app.withColumn('user', add_user_udf('`id.orig_h`'))\\\n",
    "                                  .filter(~in_list_udf('`id.orig_h`'))\n",
    "#                         .filter(col('user')!='unknown')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_user_attr(ip, username):\n",
    "    res = {}\n",
    "    res['ip'] = ip\n",
    "    res['username'] = username\n",
    "    return json.dumps(res)\n",
    "generate_user_attr_udf = udf(generate_user_attr, StringType())\n",
    "\n",
    "user_node = user_df.withColumn('type', lit('user'))\\\n",
    "              .withColumn('node_id', col('user'))\\\n",
    "              .withColumn('node_ip', col('`id.orig_h`'))\\\n",
    "              .withColumn('node_attr', generate_user_attr_udf('`id.orig_h`', 'user'))\\\n",
    "              .withColumn('ddn_id', lit('default_pii'))\\\n",
    "              .select(node_schema).distinct()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "metadata": {},
   "outputs": [],
   "source": [
    "def user_gen_from_id(orig_ip):\n",
    "    return orig_ip\n",
    "user_gen_from_id_udf = udf(user_gen_from_id, StringType())\n",
    "\n",
    "def user_gen_to_id(resp_ip, port, application):\n",
    "    if application is not None and application != 'unknown':\n",
    "        return application #resp_ip + \":\" + port + '/' + \n",
    "    return resp_ip\n",
    "user_gen_to_id_udf = udf(user_gen_to_id, StringType())\n",
    "\n",
    "# # this is a placeholder for user to application edge.\n",
    "# # currently it does NOT add any information\n",
    "# def user_gen_edge_attr(port, proto, total_bytes):\n",
    "#     res = {}\n",
    "#     ports = set()\n",
    "#     ports.add(port)\n",
    "    \n",
    "#     protos = set()\n",
    "#     protos.add(proto)\n",
    "    \n",
    "#     res['port'] = ports\n",
    "#     res['protocol'] = protos\n",
    "#     res['total_bytes'] = total_bytes\n",
    "#     return json.dumps(res)\n",
    "# user_gen_edge_attr_udf = udf(user_gen_edge_attr, StringType())\n",
    "\n",
    "user_edge = user_df.withColumn('from_id', user_gen_from_id_udf('`id.orig_h`'))\\\n",
    "                   .withColumn('to_id', user_gen_to_id_udf('`id.resp_h`','`id.resp_p`','application'))\\\n",
    "                   .withColumn('ddn_id', lit('default_pii'))\\\n",
    "                   .select(edge_schema)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes = app_node.union(user_node)\\\n",
    "                .union(db_node)\\\n",
    "                .union(web_nodes)\\\n",
    "                .union(table_nodes)\\\n",
    "                .withColumn('multi_home', multihomed_ip_udf('node_ip'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 288,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------+-----------+-------------+--------------------+-----------+\n",
      "|    type|    node_id|      node_ip|           node_attr|     ddn_id|\n",
      "+--------+-----------+-------------+--------------------+-----------+\n",
      "|database|   employee|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "|database|performance|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "|database|  customers| 192.168.8.74|{\"columns\": [\"*\",...|default_pii|\n",
      "|database|      sales| 192.168.8.74|{\"columns\": [\"eid...|default_pii|\n",
      "|database|    payment|192.168.8.155|{\"columns\": [\"eid...|default_pii|\n",
      "+--------+-----------+-------------+--------------------+-----------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "table_nodes.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 270,
   "metadata": {},
   "outputs": [],
   "source": [
    "same_edges = nodes.filter(in_web_list_udf('node_ip'))\\\n",
    "                 .withColumn('from_id', col('node_id'))\\\n",
    "                 .withColumn('to_id', col('node_ip'))\\\n",
    "                 .withColumn('direction', lit('same_machine'))\\\n",
    "                 .withColumn('proto', lit('same_machine'))\\\n",
    "                 .withColumn('ddn_id', lit('default_pii'))\\\n",
    "                 .withColumn('application', lit('same_machine'))\\\n",
    "                 .withColumn('total_bytes', lit(0)).select(edge_schema)\\"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 271,
   "metadata": {},
   "outputs": [],
   "source": [
    "# web_edge = nodes.filter(col('node_ip') == '192.168.7.100')\\\n",
    "#              .withColumn('from_id', col('node_ip'))\\\n",
    "#              .withColumn('to_id', lit('192.168.8.100'))\\\n",
    "#              .withColumn('direction', lit('same_machine'))\\\n",
    "#              .withColumn('proto', lit('same_machine'))\\\n",
    "#              .withColumn('ddn_id', lit('default_pii'))\\\n",
    "#              .withColumn('application', lit('same_machine'))\\\n",
    "#              .withColumn('total_bytes', lit(0)).select(edge_schema).distinct()\n",
    "same_edges = same_edges.filter(col('from_id') != 'web') #.union(web_edge)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 272,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+-------------+------------+-----------+------------+------------+-----------+\n",
      "|          from_id|        to_id|       proto|     ddn_id| application|   direction|total_bytes|\n",
      "+-----------------+-------------+------------+-----------+------------+------------+-----------+\n",
      "|        sales_app|192.168.7.100|same_machine|default_pii|same_machine|same_machine|          0|\n",
      "|      payroll_app|192.168.7.100|same_machine|default_pii|same_machine|same_machine|          0|\n",
      "|employee_info_app|192.168.7.100|same_machine|default_pii|same_machine|same_machine|          0|\n",
      "|     customer_app|192.168.7.100|same_machine|default_pii|same_machine|same_machine|          0|\n",
      "|  performance_app|192.168.7.100|same_machine|default_pii|same_machine|same_machine|          0|\n",
      "+-----------------+-------------+------------+-----------+------------+------------+-----------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "same_edges.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "metadata": {},
   "outputs": [],
   "source": [
    "def gen_proto(proto):\n",
    "    if proto is None:\n",
    "        return 'con'\n",
    "    return proto\n",
    "gen_proto_udf = udf(gen_proto, StringType())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 274,
   "metadata": {},
   "outputs": [],
   "source": [
    "edges = user_edge.union(app_edge)\\\n",
    "                .union(same_edges)\\\n",
    "                .union(table_edges)\\\n",
    "               .repartition(8).persist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "metadata": {},
   "outputs": [],
   "source": [
    "# edges = user_edge.union(app_edge)\\\n",
    "#                 .union(same_edges)\\\n",
    "#                 .union(table_edges)\\\n",
    "#                 .groupby('from_id', 'to_id', 'ddn_id', 'direction', 'application', 'proto')\\\n",
    "#                 .agg((sum('total_bytes')/1024).alias('total_bytes'))\\\n",
    "#                 .withColumn('proto', gen_proto_udf('proto'))\\\n",
    "#                 .repartition(8).persist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 276,
   "metadata": {},
   "outputs": [],
   "source": [
    "edges = edges#.filter(col('direction').isNotNull())\n",
    "def reorder_edge(row):\n",
    "    new_row = {}\n",
    "    if row['direction'] == 'counter':\n",
    "        new_row['from_id'] = row['to_id']\n",
    "        new_row['to_id'] = row['from_id']\n",
    "    else:\n",
    "        new_row['from_id'] = row['from_id']\n",
    "        new_row['to_id'] = row['to_id']\n",
    "    new_row['proto'] = row['proto']\n",
    "    new_row['total_bytes'] = row['total_bytes']\n",
    "    new_row['ddn_id'] = row['ddn_id']\n",
    "    return Row(**new_row)\n",
    "edges_new = edges.rdd.map(reorder_edge).toDF()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "metadata": {},
   "outputs": [],
   "source": [
    "edge_from = edges_new.select('from_id').rdd.map(lambda row: row[0]).distinct().collect()\n",
    "edge_to = edges_new.select('to_id').rdd.map(lambda row: row[0]).distinct().collect()\n",
    "nodes_ip = nodes.select('node_ip').rdd.map(lambda row: row[0]).distinct().collect()\n",
    "nodes_id = nodes.select('node_id').rdd.map(lambda row: row[0]).distinct().collect()\n",
    "# nodes_id = nodes.select('node_id').rdd.map(lambda row: row[0]).distinct().collect()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 278,
   "metadata": {},
   "outputs": [],
   "source": [
    "# table_edges.filter(col('to_id')=='employee').show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "26"
      ]
     },
     "execution_count": 279,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_ip = set(edge_from + edge_to + nodes_ip + nodes_id)\n",
    "len(all_ip)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 280,
   "metadata": {},
   "outputs": [],
   "source": [
    "ip_map = {}\n",
    "all_ip = list(all_ip)\n",
    "for i in range(0, len(all_ip)):\n",
    "    ip_map[all_ip[i]] = i\n",
    "web_id = ip_map.get('web')\n",
    "ip_map['192.168.7.100'] = web_id\n",
    "ip_map['192.168.8.100'] = web_id\n",
    "\n",
    "mssql_id = ip_map.get('mssql')\n",
    "ip_map['192.168.8.155'] = mssql_id\n",
    "mysql_id = ip_map.get('mysql')\n",
    "ip_map['192.168.8.74'] = mysql_id\n",
    "\n",
    "def map_ip(ip, second = None):\n",
    "    if second is None:\n",
    "        return ip_map.get(ip)\n",
    "    if '.' not in ip:\n",
    "        return ip_map.get(second)\n",
    "    return ip_map.get(second)\n",
    "map_ip_udf = udf(map_ip, IntegerType())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 281,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "6"
      ]
     },
     "execution_count": 281,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "map_ip( 'web', '192.168.8.100')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 282,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'172.27.232.19': 0,\n",
       " '172.27.232.20': 21,\n",
       " '192.168.7.100': 6,\n",
       " '192.168.7.104': 17,\n",
       " '192.168.7.122': 1,\n",
       " '192.168.7.159': 14,\n",
       " '192.168.7.171': 8,\n",
       " '192.168.7.178': 24,\n",
       " '192.168.7.180': 11,\n",
       " '192.168.7.254': 15,\n",
       " '192.168.8.100': 6,\n",
       " '192.168.8.155': 22,\n",
       " '192.168.8.74': 25,\n",
       " 'customer_app': 2,\n",
       " 'customers': 13,\n",
       " 'employee': 20,\n",
       " 'employee_info_app': 9,\n",
       " 'mssql': 22,\n",
       " 'mysql': 25,\n",
       " 'payment': 7,\n",
       " 'payroll_app': 4,\n",
       " 'performance': 5,\n",
       " 'performance_app': 16,\n",
       " 'sales': 18,\n",
       " 'sales_app': 19,\n",
       " 'web': 6}"
      ]
     },
     "execution_count": 282,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ip_map"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 291,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes_final = nodes.withColumn('iid', map_ip_udf('node_id'))\\\n",
    "                    .drop('node_attr', 'node_ip')\\\n",
    "                    .distinct().repartition(4).persist()\n",
    "\n",
    "edges_final = edges_new.withColumn('iid_from', map_ip_udf('from_id'))\\\n",
    "                    .withColumn('iid_to', map_ip_udf('to_id'))\\\n",
    "                    .repartition(4).persist()\\\n",
    "                    .groupby('iid_from', 'iid_to', 'ddn_id', 'proto')\\\n",
    "                    .agg((sum('total_bytes')/1024).alias('total_bytes'))\\\n",
    "                    .withColumn('proto', gen_proto_udf('proto'))\\\n",
    "            "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------+------+-----------+------------+--------------------+\n",
      "|iid_from|iid_to|     ddn_id|       proto|         total_bytes|\n",
      "+--------+------+-----------+------------+--------------------+\n",
      "|       6|    25|default_pii|         tcp|  22.050378799438477|\n",
      "|       4|     6|default_pii|same_machine|                 0.0|\n",
      "|      19|    21|default_pii|         tcp|      0.037841796875|\n",
      "|       9|     6|default_pii|same_machine|                 0.0|\n",
      "|       4|     0|default_pii|         tcp| 0.06339645385742188|\n",
      "|      22|     6|default_pii|         tcp|  18.665061950683594|\n",
      "|      14|     6|default_pii|         tcp|                 0.0|\n",
      "|       4|    21|default_pii|         con|                 0.0|\n",
      "|       1|     6|default_pii|         tcp|3.452301025390625E-4|\n",
      "|       0|     6|default_pii|         tcp|   68.30154418945312|\n",
      "|      21|     6|default_pii|         tcp|0.002843856811523...|\n",
      "|      16|     1|default_pii|         tcp|                 0.0|\n",
      "|      24|     6|default_pii|         tcp|                 0.0|\n",
      "|       4|    17|default_pii|         tcp|                 0.0|\n",
      "|       2|    21|default_pii|         tcp|   0.066619873046875|\n",
      "|       6|    22|default_pii|         tcp|   18.73050022125244|\n",
      "|      22|    20|default_pii|same_machine|                 0.0|\n",
      "|       9|    17|default_pii|         tcp|                 0.0|\n",
      "|       8|     6|default_pii|         tcp|                 0.0|\n",
      "|       9|     0|default_pii|         tcp| 0.11121749877929688|\n",
      "+--------+------+-----------+------------+--------------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "edges_final.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 292,
   "metadata": {},
   "outputs": [],
   "source": [
    "# nodes.withColumn('iid', map_ip_udf('node_id'))\\\n",
    "#      .drop('node_attr').toPandas()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 293,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # nodes.toPandas()\n",
    "# nodes_final.drop('node_attr').repartition(1).write.mode('overwrite').option(\"header\", \"true\").csv('nodes.csv')\n",
    "# edges_final.repartition(1).write.mode('overwrite').option(\"header\", \"true\").csv('edges.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 294,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes_local = nodes_final.toPandas()\n",
    "edges_local = edges_final.toPandas()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 296,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "42\n"
     ]
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "def gen_node_query(iid, name, label):\n",
    "    return \"CREATE (n%s:%s {id:%s, name:'%s'});\" % (iid, label, iid, name)\n",
    "\n",
    "def gen_edge_query(iid_from, iid_to, proto):\n",
    "    return \"MATCH (a {id:%s}), (b {id:%s}) CREATE (a)-[r:%s]->(b);\" % (iid_from, iid_to, proto)\n",
    "\n",
    "graph = Graph(\"http://192.168.7.143:7474/db/data/\")\n",
    "queries = \"\"\n",
    "cnt = 0\n",
    "for index, row in nodes_local.iterrows():\n",
    "    query = gen_node_query(row['iid'], row['node_id'], row['type'])\n",
    "    queries+=query\n",
    "#     cnt+=1\n",
    "    graph.run(query)\n",
    "for index, row in edges_local.iterrows():\n",
    "    query = gen_edge_query(row['iid_from'], row['iid_to'], row['proto'] + '_' + str(int(row['total_bytes'])))\n",
    "    queries+=query\n",
    "    cnt+=1\n",
    "    graph.run(query)\n",
    "print(cnt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 170,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"CREATE (n5:application {id:5, name:'web'});CREATE (n13:user {id:13, name:'192.168.7.159'});CREATE (n23:database {id:23, name:'mysql'});CREATE (n14:user {id:14, name:'192.168.7.254'});CREATE (n18:user {id:18, name:'172.27.232.20'});CREATE (n10:user {id:10, name:'192.168.7.180'});CREATE (n5:application {id:5, name:'web'});CREATE (n16:database {id:16, name:'sales'});CREATE (n7:database {id:7, name:'payment'});CREATE (n1:user {id:1, name:'192.168.7.122'});CREATE (n4:application {id:4, name:'customer'});CREATE (n22:user {id:22, name:'192.168.7.178'});CREATE (n21:application {id:21, name:'employee_info'});CREATE (n3:application {id:3, name:'performance'});CREATE (n17:database {id:17, name:'employee'});CREATE (n3:database {id:3, name:'performance'});CREATE (n6:application {id:6, name:'payroll'});CREATE (n0:user {id:0, name:'172.27.232.19'});CREATE (n8:user {id:8, name:'192.168.7.171'});CREATE (n16:application {id:16, name:'sales'});CREATE (n19:database {id:19, name:'mssql'});CREATE (n15:user {id:15, name:'192.168.7.104'});CREATE (n12:database {id:12, name:'customers'});MATCH (a {id:6}), (b {id:18}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:1}), (b {id:5}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:5}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:6}), (b {id:1}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:21}), (b {id:18}) CREATE (a)-[r:tcp_51]->(b);MATCH (a {id:6}), (b {id:15}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:23}), (b {id:12}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:3}), (b {id:0}) CREATE (a)-[r:tcp_63]->(b);MATCH (a {id:21}), (b {id:15}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:16}), (b {id:18}) CREATE (a)-[r:tcp_38]->(b);MATCH (a {id:0}), (b {id:5}) CREATE (a)-[r:tcp_3]->(b);MATCH (a {id:21}), (b {id:1}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:21}), (b {id:18}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:13}), (b {id:5}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:14}), (b {id:5}) CREATE (a)-[r:icmp_1]->(b);MATCH (a {id:19}), (b {id:5}) CREATE (a)-[r:tcp_19113]->(b);MATCH (a {id:18}), (b {id:5}) CREATE (a)-[r:tcp_2]->(b);MATCH (a {id:23}), (b {id:5}) CREATE (a)-[r:tcp_22254]->(b);MATCH (a {id:5}), (b {id:19}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:22}), (b {id:5}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:5}), (b {id:19}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:5}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:19}), (b {id:7}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:15}), (b {id:5}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:6}), (b {id:0}) CREATE (a)-[r:tcp_64]->(b);MATCH (a {id:5}), (b {id:19}) CREATE (a)-[r:tcp_4]->(b);MATCH (a {id:19}), (b {id:17}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:18}), (b {id:5}) CREATE (a)-[r:icmp_0]->(b);MATCH (a {id:10}), (b {id:5}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:23}), (b {id:16}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:6}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:3}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:5}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:21}), (b {id:0}) CREATE (a)-[r:tcp_113]->(b);MATCH (a {id:8}), (b {id:5}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:6}), (b {id:18}) CREATE (a)-[r:tcp_26]->(b);MATCH (a {id:4}), (b {id:15}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:19}), (b {id:3}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:21}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:4}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:5}), (b {id:23}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:5}), (b {id:19}) CREATE (a)-[r:tcp_19175]->(b);MATCH (a {id:19}), (b {id:5}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:5}), (b {id:23}) CREATE (a)-[r:tcp_22579]->(b);MATCH (a {id:0}), (b {id:5}) CREATE (a)-[r:tcp_69936]->(b);MATCH (a {id:16}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:16}), (b {id:15}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:3}), (b {id:1}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:4}), (b {id:18}) CREATE (a)-[r:tcp_68]->(b);\""
      ]
     },
     "execution_count": 170,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 234,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "22"
      ]
     },
     "execution_count": 234,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes_final.drop('node_ip').distinct().count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>node_id</th>\n",
       "      <th>node_ip</th>\n",
       "      <th>ddn_id</th>\n",
       "      <th>multi_home</th>\n",
       "      <th>iid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>application</td>\n",
       "      <td>web</td>\n",
       "      <td>192.168.7.100</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>192.168.7.100,192.168.8.100</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>user</td>\n",
       "      <td>192.168.7.159</td>\n",
       "      <td>192.168.7.159</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>database</td>\n",
       "      <td>mysql</td>\n",
       "      <td>192.168.8.74</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>user</td>\n",
       "      <td>192.168.7.254</td>\n",
       "      <td>192.168.7.254</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>user</td>\n",
       "      <td>172.27.232.20</td>\n",
       "      <td>172.27.232.20</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>user</td>\n",
       "      <td>192.168.7.180</td>\n",
       "      <td>192.168.7.180</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>application</td>\n",
       "      <td>web</td>\n",
       "      <td>192.168.8.100</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>192.168.7.100,192.168.8.100</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>database</td>\n",
       "      <td>sales</td>\n",
       "      <td>192.168.8.74</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>database</td>\n",
       "      <td>payment</td>\n",
       "      <td>192.168.8.155</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>user</td>\n",
       "      <td>192.168.7.122</td>\n",
       "      <td>192.168.7.122</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>application</td>\n",
       "      <td>customer</td>\n",
       "      <td>192.168.7.100</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>192.168.7.100,192.168.8.100</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>user</td>\n",
       "      <td>192.168.7.178</td>\n",
       "      <td>192.168.7.178</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>application</td>\n",
       "      <td>employee_info</td>\n",
       "      <td>192.168.7.100</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>192.168.7.100,192.168.8.100</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>application</td>\n",
       "      <td>performance</td>\n",
       "      <td>192.168.7.100</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>192.168.7.100,192.168.8.100</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>database</td>\n",
       "      <td>employee</td>\n",
       "      <td>192.168.8.155</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>database</td>\n",
       "      <td>performance</td>\n",
       "      <td>192.168.8.155</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>application</td>\n",
       "      <td>payroll</td>\n",
       "      <td>192.168.7.100</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>192.168.7.100,192.168.8.100</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>user</td>\n",
       "      <td>172.27.232.19</td>\n",
       "      <td>172.27.232.19</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>user</td>\n",
       "      <td>192.168.7.171</td>\n",
       "      <td>192.168.7.171</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>application</td>\n",
       "      <td>sales</td>\n",
       "      <td>192.168.7.100</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>192.168.7.100,192.168.8.100</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>database</td>\n",
       "      <td>mssql</td>\n",
       "      <td>192.168.8.155</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>user</td>\n",
       "      <td>192.168.7.104</td>\n",
       "      <td>192.168.7.104</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>database</td>\n",
       "      <td>customers</td>\n",
       "      <td>192.168.8.74</td>\n",
       "      <td>default_pii</td>\n",
       "      <td>None</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           type        node_id        node_ip       ddn_id  \\\n",
       "0   application            web  192.168.7.100  default_pii   \n",
       "1          user  192.168.7.159  192.168.7.159  default_pii   \n",
       "2      database          mysql   192.168.8.74  default_pii   \n",
       "3          user  192.168.7.254  192.168.7.254  default_pii   \n",
       "4          user  172.27.232.20  172.27.232.20  default_pii   \n",
       "5          user  192.168.7.180  192.168.7.180  default_pii   \n",
       "6   application            web  192.168.8.100  default_pii   \n",
       "7      database          sales   192.168.8.74  default_pii   \n",
       "8      database        payment  192.168.8.155  default_pii   \n",
       "9          user  192.168.7.122  192.168.7.122  default_pii   \n",
       "10  application       customer  192.168.7.100  default_pii   \n",
       "11         user  192.168.7.178  192.168.7.178  default_pii   \n",
       "12  application  employee_info  192.168.7.100  default_pii   \n",
       "13  application    performance  192.168.7.100  default_pii   \n",
       "14     database       employee  192.168.8.155  default_pii   \n",
       "15     database    performance  192.168.8.155  default_pii   \n",
       "16  application        payroll  192.168.7.100  default_pii   \n",
       "17         user  172.27.232.19  172.27.232.19  default_pii   \n",
       "18         user  192.168.7.171  192.168.7.171  default_pii   \n",
       "19  application          sales  192.168.7.100  default_pii   \n",
       "20     database          mssql  192.168.8.155  default_pii   \n",
       "21         user  192.168.7.104  192.168.7.104  default_pii   \n",
       "22     database      customers   192.168.8.74  default_pii   \n",
       "\n",
       "                     multi_home  iid  \n",
       "0   192.168.7.100,192.168.8.100    5  \n",
       "1                          None   13  \n",
       "2                          None   23  \n",
       "3                          None   14  \n",
       "4                          None   18  \n",
       "5                          None   10  \n",
       "6   192.168.7.100,192.168.8.100    5  \n",
       "7                          None   16  \n",
       "8                          None    7  \n",
       "9                          None    1  \n",
       "10  192.168.7.100,192.168.8.100    4  \n",
       "11                         None   22  \n",
       "12  192.168.7.100,192.168.8.100   21  \n",
       "13  192.168.7.100,192.168.8.100    3  \n",
       "14                         None   17  \n",
       "15                         None    3  \n",
       "16  192.168.7.100,192.168.8.100    6  \n",
       "17                         None    0  \n",
       "18                         None    8  \n",
       "19  192.168.7.100,192.168.8.100   16  \n",
       "20                         None   19  \n",
       "21                         None   15  \n",
       "22                         None   12  "
      ]
     },
     "execution_count": 135,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes_local"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'MATCH (a {id:15}), (b {id:0}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:17}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:15}), (b {id:3}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:21}), (b {id:5}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:19}), (b {id:18}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:2}), (b {id:0}) CREATE (a)-[r:tcp_67]->(b);MATCH (a {id:15}), (b {id:21}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:8}), (b {id:18}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:15}), (b {id:18}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:7}), (b {id:10}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:22}), (b {id:21}) CREATE (a)-[r:tcp_46]->(b);MATCH (a {id:2}), (b {id:18}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:2}), (b {id:21}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:8}), (b {id:0}) CREATE (a)-[r:tcp_51]->(b);MATCH (a {id:2}), (b {id:3}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:22}), (b {id:3}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:2}), (b {id:3}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:2}), (b {id:0}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:22}), (b {id:21}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:15}), (b {id:18}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:16}), (b {id:20}) CREATE (a)-[r:tcp_26141]->(b);MATCH (a {id:7}), (b {id:20}) CREATE (a)-[r:tcp_34572]->(b);MATCH (a {id:20}), (b {id:16}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:5}), (b {id:20}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:16}), (b {id:9}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:15}), (b {id:21}) CREATE (a)-[r:tcp_50]->(b);MATCH (a {id:20}), (b {id:16}) CREATE (a)-[r:tcp_4]->(b);MATCH (a {id:16}), (b {id:13}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:7}), (b {id:8}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:15}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:22}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:17}), (b {id:20}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:2}), (b {id:21}) CREATE (a)-[r:tcp_86]->(b);MATCH (a {id:19}), (b {id:0}) CREATE (a)-[r:tcp_90]->(b);MATCH (a {id:15}), (b {id:3}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:19}), (b {id:0}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:15}), (b {id:0}) CREATE (a)-[r:tcp_39]->(b);MATCH (a {id:19}), (b {id:18}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:16}), (b {id:22}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:2}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:19}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:20}), (b {id:7}) CREATE (a)-[r:tcp_0]->(b);MATCH (a {id:2}), (b {id:18}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:16}), (b {id:20}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:8}), (b {id:0}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:21}), (b {id:5}) CREATE (a)-[r:tcp_29825]->(b);MATCH (a {id:22}), (b {id:3}) CREATE (a)-[r:con_0]->(b);MATCH (a {id:8}), (b {id:5}) CREATE (a)-[r:same_machine_0]->(b);MATCH (a {id:8}), (b {id:18}) CREATE (a)-[r:tcp_0]->(b);'"
      ]
     },
     "execution_count": 254,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "edges_json = edges.toPandas().to_json()\n",
    "nodes_json = nodes.toPandas().to_json()\n",
    "ddn_dict = {}\n",
    "ddn_dict['nodes'] = nodes_json\n",
    "ddn_dict['edges'] = edges_json\n",
    "\n",
    "import json\n",
    "with open('ddn.json', 'w') as outfile:\n",
    "    json.dump(ddn_dict, outfile)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "# def gen_hash(from_id, to_id, ddn_id, application, direction):\n",
    "#     return from_id + to_id + ddn_id + application + direction\n",
    "# gen_hash_udf = udf(gen_hash, StringType())\n",
    "# def combine_edge(row1, row2):\n",
    "#     total_bytes1 = row1['total_bytes']\n",
    "#     total_bytes2 = row2['total_bytes']\n",
    "    \n",
    "#     total_bytes = total_bytes1 + total_bytes2\n",
    "    \n",
    "#     edge_attr1 = json.loads(row1['edge_attr'])\n",
    "#     edge_attr2 = json.loads(row2['edge_attr'])\n",
    "    \n",
    "#     new_attr = {}\n",
    "#     ports = set()\n",
    "#     ports.add(edge_attr1['port'])\n",
    "#     ports.add(edge_attr2['port'])\n",
    "    \n",
    "#     protos = set()\n",
    "#     protos.add(edge_attr1['protocol'])\n",
    "#     protos.add(edge_attr2['protocol'])\n",
    "    \n",
    "#     new_attr['port'] = list(ports)\n",
    "#     new_attr['protocol'] = list(protos)\n",
    "#     new_attr['total_bytes'] = total_bytes\n",
    "    \n",
    "#     new_row = {}\n",
    "#     new_row['from_id'] = row1['from_id']\n",
    "#     new_row['to_id'] = row1['to_id']\n",
    "#     new_row['edge_attr'] = json.dumps(new_attr)\n",
    "#     new_row['ddn_id'] = row1['ddn_id']\n",
    "#     new_row['direction'] = row1['direction']\n",
    "#     new_row['total_bytes'] = row1['total_bytes']\n",
    "#     return Row(**new_row)\n",
    "# edges_combined = edges.withColumn('hash', gen_hash_udf('from_id', 'to_id', 'ddn_id', 'application', 'direction'))\\\n",
    "#      .rdd.map(lambda row: (row['hash'], row))\\\n",
    "#      .reduceByKey(combine_edge).toDF()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 235,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAecAAAFCCAYAAADL3BUJAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzs3XdYleX/wPH3YR0OWxFBZWvukaZ9\ntRCoNM29x9eRtNxFaZkTNcuV2U8tTc09UvOb5iyjxL1z4CYVcIHKEjjMc//+eODEEVREDgflfl3X\nuTzPcz/jcw5efLjnoxJCCCRJkiRJKjXMTB2AJEmSJEmGZHKWJEmSpFJGJmdJkiRJKmVkcpYkSZKk\nUkYmZ0mSJEkqZWRyliRJkqRSRiZnSZIkSSplZHKWJEmSpFJGJmdJkiRJKmVkcpYkSZKkUkYmZ0mS\nJEkqZWRyliRJkqRSRiZnSZIkSSplZHKWJEmSpFJGJmdJkiRJKmVkcpYkSZKkUkYmZ0mSJEkqZWRy\nliRJkqRSRiZnSZIkSSplZHKWJEmSpFJGJmdJkiRJKmVkcpYkSZKkUkYmZ0mSJEkqZWRyliRJkqRS\nRiZnSZIkSSplLEwdgCSVKrGxsGwZnD4NiYng6Aj160NQELi4mDo6SZLKCJUQQpg6CEkyuaNHYepU\n2LFD2U5L+7dMowEh4K23YPRoaNLENDFKklRmyOQsSfPnw8iRoNUqSfhhVColUX/9NQweXHLxSZJU\n5shmbalsy03MqamPP1YI5biRI5VtmaAlSTISOSBMKnOWLVuGn5+f0pRd2MScV26CPnbMOAFKklTm\nyeQslV1TpypN2UWh1SrnP6WsrKynvoYkSc8fmZylZ0J0dDRdunTBxcUFZ2dnhg0bxsSJE+nbt6/+\nmGvXrqFSqfQJb9myZfj6+mJvb4+Pjw+rV6/m/PnzDBo0iIMHD2L3yy845fQxJwL9ARfAC5gC6HKu\nuwx4FfgYcAJ8gQNCsOzXX/GoUoWKFSuyfPlyfRzp6emMHDkST09PXF1dGTRoENqcPwJ2796Nu7s7\n06dPx83NjaCgIO7evUu7du1wcnKifPnyNG/eHJ1OhyRJZZdMzlKpl52dTbt27fDy8uLatWvcuHGD\nXr16PfKclJQUPvzwQ3bs2MH9+/c5cOAAL774IrVq1WLBggU08/Qk2dqahJzjh6Mk6CtAGLACWJrn\neoeB+sA94L9AL+CoEEQMG8aqVasYNmwYycnJAIwaNYpLly5x8uRJIiIiuHHjBpMnT9Zf6/bt28TF\nxREZGcnChQuZNWsW7u7u3Llzh5iYGL766itUKlWxfHeSJD2bZHKWSr0jR45w8+ZNZs6cia2tLdbW\n1kqf8WOYmZkRHh6OVqulUqVK1KlT59/ClBT9dKlsYB0wFbAHvIERwMo81/IBggBzoCcQDUzIzkZ9\n/jxvvvkmVlZWREREIIRg0aJFzJ49m/Lly2Nvb8+YMWP46aefDOKaNGkSarUajUaDpaUlt27dIjIy\nEktLS5o3by6Tc2kTGwszZkDfvtC+vfLvjBlw546pI5OeUzI5S6VedHQ0Xl5eWFgUfnKBra0t69at\nY8GCBVSqVIm2bdty4cKFfw/I09d7F8hAac7O5QXcyLPtmue9Ju+++Hhln0ZDcnIyd+7cITU1lZde\negknJyecnJxo3bo1d/L8EndxccHa2lq//emnn1KtWjXefPNNfH19mTZtWqE/p2RkR49Cly7g5QUh\nIbB6NWzdqvw7cSJ4eirlR4+aOlLpOSOTs1TqeXh4EBUVlW/wlK2tLal5Rlrfvn3boLxVq1bs2rWL\nW7duUbNmTd5//30ApVaaJ9FXACyByDznRgFVChNcuXIGmxUqVECj0XD27FkSEhJISEggMTFR3+St\nv38e9vb2zJo1iytXrrBlyxa++eYbQkNDC3N3yZjmz4fAQNi0SWllybswDSiDAtPSlPLAQOV4SSom\nMjlLpd7LL79MpUqV+Pzzz0lJSSEtLY39+/fz4osvsmfPHqKiokhMTGRqntHTMTEx/Prrr6SkpKBW\nq7Gzs8Pc3BwAV1dXrmdlkaFWA0pTdQ9gLHAfJUl/A/TlMTQaqFfPYJeZmRnvv/8+H3/8MbGxsQDc\nuHGD33777aGX2bp1q75J3MHBAXNzc32skonknf/+uHWa8s5/lwlaKiYyOUulnrm5OVu2bCEiIgJP\nT0/c3d1Zt24dLVu2pGfPntSvX5+XXnqJdu3a6c/R6XTMmjWLypUrU758ecLCwvj+++8BeP3116nz\n0ku4padTIef4uYAtykhsP5RBX+88LjAhYMCAfLunT59OtWrVaNq0KQ4ODrRo0YKLFy8+9DKXL1+m\nRYsW2NnZ0axZM4YMGUJgYGBhv57nwrx582jcuDFqtZoBD3ynixcvplq1atjZ2dG6dWtu3rypL5s5\ncyZ169bVj8ifOXPmQ++RkZFBt27d8Pb2RqVSsXv37nzHnDhxAv+GDbEbMgTX1FT+L0/ZSaA54Ai4\nA5MfPDnP/PdBgwZhZ2enf6nVauzt7R8a2wcffECNGjUwMzNj2bJl+cpnz56Nm5sbjo6OvPPOO6Sn\np+c7JiwsDJVKxbhx4x56H+kZIiSprOrcWQiVSgglzT7RS6dSCdGli6k/wXNj48aN4pdffhGDBg0S\nb7/9tn7/7t27hYuLiwgPDxfp6eli0KBBwt/fX18+ffp0cfz4cZGZmSkuXLggPD09xdq1awu8R3p6\nupg9e7bYu3evcHNzE3/99ZdB+Z07d4SLi4tY1bixSAORBOJcnp95LRBjQGSBiADhBmLzg/83HvL/\n4u233xZBQUEP/fzz5s0Tf/zxh3jppZfE0qVLDcp27twpKlasKMLDw0VcXJwICAgQo0aNMjgmIyND\nNGjQQPznP/8RY8eOfeh9pGeHXFtbKruOHlX6Cp90hTBAq1KRsWsXjm+8UfxxlWHjxo3j+vXr+trj\nyJEj0Wq1fPfddwDcvHmTKlWqEBERQdWqVfOd/+GHHyKEYO7cuY+8j7u7O6tWrTJooRgzZgzRly+z\ncuvW/P3LgA1wDKids90daASMfvBAa2uIitI/xSwlJQU3Nze2bt1KQEDAI+Py8/PjvffeM2g9+O9/\n/4u3tzdfffUVAKGhofTp08dgjMW0adOIi4sjNjYWd3d3pkyZ8sj7SKWfbNaWyq4mTZSHWNjYPNFp\nKcDHQtDxiy/IyMgwTmwSAEII8tYfct+Hh4cXeOzevXsNp8w9gUOHDlH+1i1eSU+nItAeZWBgrmCU\n+e+ZwEXgINCioAupVMpjR3Ns3LgRFxcX/P39ixTX2bNnadCggX67QYMGxMTEcO/ePQAiIyNZsmQJ\nEyZMKNL1pdJJJmepbBs8+N8E/Zi5xTqUxDwC+AGlj++DDz5ANj4ZT5s2bVi/fj2nT59Gq9UyefJk\nVCqVwSj9XBMnTkSn0xEUFFSke12/fp3lR47wf0IQhTK3vXee8nbAzyhT6WoC7wIFPjxUq4UzZ/Sb\ny5cvp3///kWeu56cnIyjo6N+O/f9/fv3AaW14IsvvsDOzq5I15dKJ5mcJWnwYAgLg86dlSZJjcaw\nXKMBa2tEx44Ev/giP+QpWr58ucEocal4vfHGG0yaNImuXbvi5eWFt7c39vb2uLu7Gxw3b948VqxY\nwbZt21DnjMJ/UhqNhs6urjQBrIEQ4ADKynFxQGtgApCGsgjNb8D3D7tYzvz36OhowsLC6N+/f5Fi\nArCzsyMpKUm/nfve3t6eLVu2cP/+fXr27Fnk60ulk3xkpCQBNG4MGzcqKz4tW6bUfOLjlXnM9erB\ngAGYu7gw7d49djdtSkREhP7UsWPHUrVqVfkL0kiGDh3K0KFDAbh06RJTpkyhbt26+vIlS5Ywbdo0\n9uzZky9pP4n69eujOnBAv51bzxUoy7qao6y/Dspo7V7AdmBIQRfLmf++YsUKXnnlFXx9fYscV506\ndTh16hQ9evQA4NSpU7i6uuLs7ExoaCjHjh3Dzc0NgMTERMzNzTlz5gybN28u8j2lUsB0Y9Ek6dl0\n8eJFUa5cOYHye1sAQq1WiwMHDpg6tGdWZmam0Gq14vPPPxd9+/YVWq1Wv+/MmTNCp9OJyMhIERAQ\nIEaPHq0/b9WqVcLV1VWcO3euUPdJS0sTWq1WVKlSRfz2229Cq9UKnU4nhBAiNDRUOGk04m8rK5EB\nIhiEX84o7EQQjiBWg8gGcQtE05zR2/lG82s0QsyYIYQQonr16uLHH398bFzp6elCq9WKV155RSxc\nuFBotVqRnZ0thBBix44dwtXVVZw9e1bExcWJ1157TT9aOykpSdy6dUv/6tGjhwgODhb37t17ou9f\nKn1kcpakIti9e7ewtLQ0SNAuLi7iypUrpg7tmRQSEmLwXQIiJCRExMfHi3r16gkbGxvh6uoqPv/8\nc5GVlaU/z9vbW1hYWAhbW1v9a+DAgfry2rVri1WrVum3vby88t3n6tWr+vLvp08XlUE4gWgHIipP\n0g0F0RiEAwhXEO+BSMkpiwRhm/OvsLYWIjZWHDhwQNjY2IikpKR8n7d169biyy+/1G8HBATkiyvv\nVK9Zs2aJihUrCnt7ezFgwACRlpZW4Pf49ttvy6lUzwk5lUqSimj58uX5FsyoXbs2+/fvx8nJyTRB\nSU+vSxdlSc6i/GpUqZSxCxs3Fn9cUpkiB4RJUhG9/fbbjB071mDfuXPn6NGjB5mZmSaKSnpqo0fn\nHxRYWBqNcr4kPSWZnCXpKUyePDnfQLBdu3YxbNgwOcXqWdWkCbqZM0l50vNsbJRpeY0bGyMqqYyR\nyVmSnoKZmRlLly6ladOmBvtPnjxZ4Fxc6dkwLSGBESjz2rMfd7BK9W9iHjzY+MFJZYLsc5akYhAb\nG8t//vMfrl27hkaj4YcffqBfv36mDksqAiEETk5OJCUl8RLK8pxtURahybuWXLZajblKBW3aKE3Z\nssYsFSM5z1mSikHFihXZtm0bP//8M+3bt+fNN9+kWrVqNGvWzNShSU9ozpw5+oU+jgPdgNXffsuJ\n4GDqA05AAvBynz7UnDZNv4a2JBUnWXOWJCPYtm0b7733HgcOHMDHx8fU4UiFJITA2dmZ+JwVvgCc\nnZ25e/duvuU316xZQ+/evR+8hCQVC9nnLElG0LZtW8aMGUPbtm1JSEgwdThSIS1atMggMQNMmjQJ\nUJ4rnldcXFyJxSWVPTI5S5KRDB8+nBYtWsipVc8IIQTjxo0z2Ofo6MiQIcoCnRYWhr2AMjlLxiST\nsyQZ0TfffIOlpaWcWvUMWLNmDXfu3DHYN2bMGH1z9oPJWbaISMYkk7MkGZGFhQU//fQThw4d4ptv\nvjF1ONIjfPbZZwbbtra2jBw5Ur9taWlpUC6Ts2RMcrS2JBmZvb09W7dupVmzZlStWpVOnTqZOiTp\nAf/73/+4efOmwb4RI0ZgZvZv/cXKysqgPDExsURik8omWXOWpBLg4eHBpk2beP/99zl+/Lipw5Ee\n8PHHHxtsazQaxo8fb7DvwedEy+QsGZNMzpJUQho3bsyiRYvo2LEj0dHRpg5HyrFjxw6ioqIM9g0Z\nMiRfH7O1tbXB9v37940em1R2yWZtSSpBnTp1IiIignbt2rFv3z7s7e1NHVKZ9+GHHxpsW1lZ8eWX\nX+Y77sHknJycbNS4pLJN1pwlqYSNGDGCpk2b0qtXL7KyskwdTpkWFhZGRESEwb533303XxM2KE3d\necmas2RMMjlLUglTqVTMmzePzMxMPvnkE1OHU6YNfuBBFRYWFsycObPAY21sbAy2U1Ke+LlVklRo\nMjlLkglYWlqyfv16QkNDmTt3rqnDKZOOHDnC+fPnDfb16dMHW1vbAo9/MDnLp45JxiT7nCXJRJyc\nnNi6dSuvvvoqvr6+tG3b1tQhlSkffPCBwba5uTn/93//99DjH0zaWq0WnU5nMN1KkoqL/F8lSSbk\n4+PDxo0bCQoK4tSpU6YOp8w4efJkvu+7a9euODo6PvScB/ucQfY7S8Yjk7MkmVizZs2YO3cu7du3\n59atW6YOp0wYOHCgwbaZmRnffffdI88paJBY7qMlJam4yWZtSSoFevbsSUREBO3btycsLOyh/Z7S\n0zt//jxHjhwx2Ne2bVsqVKjwyPMeXCEMZHKWjEfWnCWplBgzZgx169alb9++6HQ6U4fz3Hqwr1ml\nUjF//vzHnvdgzbl58+Y4ODgUa2ySlEsl5KNyJKnUyMjI4M0336RJkyYPndIjFd0///xDtWrVDPa1\nbNmS33///bHnxsbGcvfuXerVq0fDhg3Zt29fvoVJJKm4yGZtSSpFrKys+N///kfTpk154YUX8tXy\npKczaNCgfPsWLFhQqHMrVqyIi4sLOp2O1NRUmZglo5LJWZJKmfLly7Nt2zaaN2+Oj48PLVu2NHVI\nz4WYmBhCQ0MN9vn5+eHr61voa6hUKqysrORDLySjk33OklQKvfDCC2zYsIE+ffpw7tw5U4fzXDA3\nN6du3boG+wrT1/wgtVotp1BJRidrztLTi42FZcvg9GlITARHR6hfH4KCwMXF1NE9s5o3b86sWbNo\n164dhw4domLFiqYO6ZlWoUIFevbsyblz53jxxRextbXNl6wLQ61WExcXJxcgkYxKDgiTiu7oUZg6\nFXbsULbT0v4t02hACHjrLRg9Gpo0MU2Mz4EJEyawa9cu/vzzzwIXwpAKJzMzE2dnZzp37szy5cvJ\nyMgocHrU43h4eJCYmEh0dPQjFy2RpKch/+yTimb+fAgMhE2blKScNzEDaLXKvk2blOOK0HwoKSZN\nmoSPjw9BQUFyitVTmDt3LlqtllmzZgEFz1suDLVaja2trZzjLBmVTM7Sk5s/H0aOhNRUpXb8KEIo\nx40cKRN0EalUKpYsWUJ0dDQTJkwwdTjPpKysLL744gs6d+782MVGHsfKykomZ8noZHKWnszRo/8m\n5ieRm6CPHSvyrb29vfnjjz+KfP6zzNramk2bNrF27VqWL19u6nCeOQsXLiQ5OZnZs2c/9bVya85y\nxLZkTDI5S09m6lSlybootFrlfKlIXFxc2Lp1K5999hm7d+82dTjPDJ1Ox4QJE2jVqhVVqlR56uup\n1Wo0Go2sOUtGJZNzGeLt7c3UqVOpXbs25cqVIygoiLS0NOLj42nXrh0uLi6UK1eOdu3acf36dQA2\nbNjASy+9pFwgNhZ27GCWEHTKueYAYAjwFmAHvArcBoKBckBN4O/cAITg5rZtdM25l4+PD3PmzNHH\nN3HiRHr06EH//v2xt7enTp06HMupaffr14+oqCjat2+PnZ0dM2bMMOZXVWrVqlWLNWvW0LNnTy5d\numTqcJ4Jy5cvJyEhweD/2tNQq9VYW1vL5CwZlUzOZczq1av57bff+Oeff7h06RJTpkxBp9MRFBRE\nZGQkUVFRaDQahg0bBkCHDh24evWq8lD6ZcsAWAX0y3PN9cAU4C6gBpoBjXK2uwGf5BynA9pnZNAg\nI4MbN24QGhrKt99+y2+//aa/1q+//kqvXr1ISEigQ4cO+jhWrlyJp6cnW7ZsITk5mc8++8xo31Fp\n98Ybb/Dll1/Stm1b7t27Z+pwSjWdTsfo0aMJCAh4osVGHiU3OctmbcmYZHIuY4YNG4aHhwfly5dn\n7NixrF27FmdnZ7p27YqNjQ329vaMHTuWsLAwQPlF1LNnT1atWgWnT3M2LY1rQLs81+wMvARY57y3\nBvoD5kBP/q05HwXuCMEENzesrKzw9fXl/fff56efftJfy8/PjzZt2mBubk6/fv3kM44f4r333qNL\nly507tyZ9PR0U4dTaq1bt4579+4xb968YrumrDlLJUEm5zLGw8ND/97Ly4ubN2+SmprKwIED8fLy\nwsHBAX9/fxISEsjOzgbg7bffZs2aNYiEBFYCPVBqyLlc87zXFLCdnPM+ErgJOK1di5OTE05OTnz1\n1VfExMToj3dzc9O/t7GxIS0tjaysrOL46M+dqVOn4uLiwvvvv49criA/IQSffvopL7/8MrVq1Sq2\n66rVaqysrGRyloxKJucyJjo6Wv8+KiqKypUrM2vWLC5evMjhw4dJSkpiz549APpf+E2bNsXKyoq9\n6emswbBJ+0l4AD5AQu/eJCQkkJCQwP3799m+fXuhzlepVEW88/PJzMyMlStXcuHCBaZMmWLqcEqd\nTZs2ERMTw9y5c4v1umq1GktLS5mcJaOSybmM+e6777h+/TpxcXF89dVX9OzZk/v376PRaHByciIu\nLo5JkyblO69///4MCw/HQqXCr4j3fhlwUKmYfvcuWq2W7OxswsPDOXr0aKHOd3V15cqVK0W8+/PJ\nxsaGX3/9lR9//JG1a9eaOpxSQwjBJ598Qr169WjUqFGxXju35iz7nCVjksm5jPnvf//Lm2++ia+v\nL76+vowbN47g4GC0Wi0VKlSgadOmtG7dOt95/fr1Izwmhn5PsZawObDFyoqT1tb4+PhQoUIF3nvv\nvUL/khs9ejRTpkzBycmJr7/+ushxPG/c3NzYsmULH330EQcOHDB1OKXCzp07uXHjRrGN0M5LrVZj\nbm4ua86SUcm1tcsQb29vFi9eTIsWLZ74XK1WS8WKFTnRrBkv/PHH41cGK4hKBZ07w8aNT36u9Fg7\nd+4kKCiI/fv3F9vI5GeREIKaNWtibm5ulCd6BQcHk5aWxpUrV/j999+L/fqSBLLmLBXS/PnzadKk\nCS98+aXyUIui0GiUh2BIRtG6dWvGjx9P27ZtSUhIMHU4JvPnn39y9epVvv32W6NcX61WY2ZmJpu1\nJaOSj4yUHsvb2xshBJs2bYKGDeHrr598CU8bG+W8xo2NF6jEkCFDuHz5Mt26dWPHjh1YWlqaOqQS\nFxwcjIeHBy1btjTK9dVqNSkpKbJZWzIqmZzLkGvXrhXPeYMHK/+OHKksyfmIJm6dSoWZRqMk5tzz\nJKP6+uuv6dSpE4MHD2bRokVlapT7vn37uHTpEuvWrTPa51ar1ahUKpmcJaOSzdpS0QweDGFhSh+y\ntXW+pu5UQAuc9vVVjpOJucSYm5uzdu1ajh8/zsyZM00dTon66KOPqFixIh07djTaPdRqZZa/TM6S\nMcmas1R0jRsrg7vu3FGW9jxzhtsXLvD70aOcBpYDlW1tOSWbskucnZ0dW7ZsoVmzZlSrVo0uXbqY\nOiSjO3z4MOHh4SxZssSorQVqtRqdTqefDmhubm60e0lllxytLRWr+Ph4nJ2dDVasunv3Ls7OziaM\nquw6ceIErVu3Ztu2bTRp0kTZGRur/DF1+jQkJoKjI9SvD0FB4OJi0nifRrNmzbhy5Qo3b940asJc\nuHAhR48eZcOGDVy7dg0nJyej3Usqu2SztlSsypUrR4MGDQz27d2710TRSI0aNWLx4sV06tSJ21u2\nQJcu4OUFISGwejVs3ar8O3EieHoq5YVcFKY0+fvvvzlx4gRTpkwxek1WrVaTnp6Og4ODbNqWjEYm\nZ6nYBQQEGGznPkRDMo0OHTqwvFkzHDt2RGzaBGlpyisvrVbZt2kTBAbC/PkmibWoPv74Y2xtbRkw\nYIDR75WbnB0dHeV0KsloZHKWip1MzqXM/Pm8sWMHGiFQPa4XSwhlitzIkc9Mgj5z5gyHDh0iJCSk\nRKaOWVlZyZqzZHQyOUvFrnnz5gbbJ0+eJD4+3kTRlA7z5s2jcePGqNXqfLW7xYsXU61aNezs7Gjd\nujU3b97Ul82cOZO6detib2+Pj4/PI0dfZ2Rk0K1bN7y9vVGpVOzevVtpoh45ElXOnPQTgD9gh/L0\nsP/Lc/5JoDngCLinpjL5o4/g2LEC7yWEYNy4cVSpUgVHR0cCAwM5e/ZsgcdGRUVhZ2dn8FKpVMya\nNSvfsUFBQahUKiIiIh76OR80cuRI1Go1AwcOLPQ5T0M2a0slQSZnqdhVqFCBunXr6reFEOzbt8+E\nEZle5cqVGTduHO+8847B/rCwMMaMGcPmzZuJi4vDx8eH3r1768uFEKxYsYL4+Hh27tzJvHnzDJ5/\n/SA/Pz9WrVr176M3p05VmqyBu0BrYCBwD4gA3sxz7n9REnccEAbMz8zk1+HDC7zPhg0bWLJkCXv3\n7iUuLo5mzZrRr1/Bzyvz9PQkOTlZ/zpz5gxmZmZ07drV4Lh9+/bxzz//PPSzFeT8+fOEhYUxatQo\nrK2tn+jcolKr1WRkZODg4CCbtSWjkclZMorAwECD7bLetN2lSxc6deqUb9T6li1b6N69O3Xq1MHK\nyorx48ezZ88efZL67LPPaNSoERYWFtSoUYOOHTuyf//+Au9hZWVFcHAwfn5+yqCo+HjYsUO/SMw3\nQCugD8rzuO2BvE85vpZTZg5UBfyAs8eOKVPlHnD16lX8/Pzw9fXF3Nycvn37Fnod6xUrVuDv74+3\nt7d+X1ZWFsOHD2fevHmFukauUaNGYW5uzocffvhE5z2NvH3OsuYsGYtMzpJRyH7nwhFCGEw7y30f\nHh5e4LF79+6lTp06hbv4zp0Gm4eA8sArQEWgPRCVpzwYWAFkAheBg0ALc3Nl2tUDevXqRUREBJcu\nXSIzM5Ply5cX+DSzgqxYsYK3337bYN/s2bPx9/enfv36hftsQEREBL///jvBwcHY2dkV+rynJZu1\npZIgFyGRjMLf399g+8SJEyQlJeHg4GCiiEqnNm3a0LNnTwYNGsQLL7zA5MmTUalUpBawbvnEiRPR\n6XQEBQUV7uJXrhiMyr6O0ue8C6gHfAb0BnLr4e2A/sDXQDYwAWiSng5nzuS7dKVKlWjevDk1atTA\n3NwcDw8P/vzzz8eGtHfvXmJiYujWrZt+X3R0ND/88APHjx8v3OfKMXr0aFQqFSNHjnyi856WTM5S\nSZA1Z8koKlasSK1a/zaa6nS6Mt/vXJA33niDSZMm0bVrV7y8vPD29sbe3h53d3eD4+bNm8eKFSvY\ntm2bfvnIx0pONtjUAJ2BJoA1EAIcABJR+plboyTkNCAa+A34HpTm8QdMmjSJo0ePEh0dTVpaGiEh\nIbz++usF/lGR1/Lly+natatBTTc4OJgJEybg6OhYuM+Fst77li1bGDRoEOXKlSv0ecVBTqWSSoJM\nzpLRyKbtwhk6dCiXL18mNjaWrl27kpWVZTCgbsmSJUybNo3Q0NB8SfuRHmjqrQ/kXdQy970ArqD0\nNfdHaU5zB3oB2wEKSH6nTp0ZOjn4AAAgAElEQVSiZ8+euLu7Y2FhwYABA4iPj39kv7NWq2XDhg35\nmrRDQ0P59NNPcXNz0w9ka9asGWvWrHnotcaPH49KpWK0CR5BKmvOUkmQyVkymryDwhwcHDAzK7v/\n3bKyskhLSyM7O5vs7GzS0tL0+8LDwxFCEBUVxQcffMBHH32krw2uXr2aMWPGsGvXLnx9fR97n/T0\ndNJymrIzvLxIVavJ7dEOAn5BmTKVCXyBMujLCaiOkqTXADrgNrAOaGBhAfXq5btPkyZN2LBhAzEx\nMeh0OlauXElmZibVqlV7aGy//PILTk5OvPbaawb7L126xKlTpzh58iQnT54ElIFynTt3LvA60dHR\nbNiwgf79+1OxYsXHfifFTSZnqUQISTKS2NhYMWfOHNGvXz8xefJkU4djUiEhIQIl/+lfISEhIj4+\nXtSrV0/Y2NgIV1dX8fnnn4usrCz9ed7e3sLCwkLY2trqXwMHDtSX165dW6xatUq/7eXlle8+V5Xx\n2kKA+B5EZRBOINqBiMpTFgqiMQgHEK4g3gNx39JSiNhYERkZKWxtbUVkZKQQQgitViuGDBki3Nzc\nhL29vWjYsKHYsWOHPo6BAwcaxCmEEG+++aYYN27cY78rQFy+fPmh5e+++65Qq9UiOjr68V+8Edy9\ne1eUK1dO7Nq1S7zxxhsmiUF6/skHX0hGt2XLFubMmcOuXbtMHUqZoNVq+eSTT1iwYAEbgY4oTdZP\nSqdSsd3Skt8++IDJkyeXeN9uQW7duoWvry9du3Zl1apVJokhOTkZV1dX/vrrL4YNG8aRI0dMEof0\nfCu77YxSiWnevDmHDx8mMzPT1KE898LDw2nSpAkLFiwAYCrKAK+iMNNo8Nu2jaysLGrVqsXixYvR\n6XTFFmtRTJkyBVAGpJmKbNaWSoJMzpLROTk5UbVqVY49ZClIqfh8/PHHBstoHgM+U6nIfNI1p21s\n4OuvcWrRgvnz57N9+3aWLl1K06ZNTVZTjI2NZenSpbz11ltUrVrVJDEAWFhYoNPpsLW1laO1JaOR\nyVkqEQEBAXK0dgnIO8oboGrVqgw4fBjL//s/JeGqVA85M4dKpU/MDB6s392oUSP27dvH8OHD6dSp\nE++++y6xsbHG+AgPNX36dAC++OKLEr3vg1QqFWq1Gmtra1lzloxGJmepRAQEBCgPYpCMIikpiYYN\nGzJ37lz9IiX9+/fn77//pkmTJkqiDQuDzp3B2ho0GsMLaDTK/s6dlePyJOZcKpWKfv36ceHCBcqV\nK0edOnWYM2cOWVlZRv989+7dY8GCBQQEBBR+hTQjUqvVmJubk56eXiKfXyp75IAwqUTcu3cPX19f\n7t27h4WFXJiuOG3dupXu3btTvnx59uzZQ9WqVTl48CDNmjUr+IQ7d5QlOc+cURYYKVdOmS41YAC4\nuBT6vufPn+fDDz/k9u3bzJ07N9966sVp9OjRzJkzhz179vDSSy8Z7T6F5erqyqlTp6hVqxZXrlwp\nFYPlpOeMaQeLS2VJvXr1xOHDh00dxnMjOztb9O/fX6hUKtGnTx+RnZ1d4jHodDrx888/C09PT9Gz\nZ0+jTG+Kj48Xtra2wt/fv9ivXVQeHh7i2rVrwsvLS1y9etXU4UjPIdmsLZUY2e9cfK5evYqnpyfr\n169n06ZNrFq1yiSLvKhUKrp27cr58+epXr06L774IlOnTiU9Pb3Y7vHtt9+iUqn48ssvi+2aT0uO\n2JaMTSZnqcTI5Fw8vv/+e1544QUqVKjArVu36NChg6lDwsbGhsmTJ3PkyBEOHTpE3bp12b59+1Nf\nNykpiW+++YaaNWvi5+dXDJEWDysrK5mcJaOSyVkqMf7+/uzbt4/s7GxTh/JMSktL47XXXmP48OGM\nGTOGkydP4uTkZOqwDPj6+rJ582bmzJlDcHAwHTp00D+buijmzZtX6mrNIB9+IRmfTM5SialYsSJV\nqlTRr58sFd7BgwdxdXXl9OnTHD9+nMmTJ5s6pEd66623OHPmDK+88gr/+c9/GD9+/GOfWPWglJQU\nZsyYgYeHBy1btjRSpEWjVqvJyMiQNWfJaGRylkqUbNp+ciNGjODVV1/l1VdfJSYmhhdffNHUIRWK\nWq3m888/5+TJk0RERFCrVi1+/vlnRCEniMyfP19fa1Y9bn52CZN9zpKxyeQslSiZnAsvNjaWmjVr\nMnfuXJYuXcr27dufyWlo7u7urF27luXLlzNp0iRatmz5yEdLgrI++FdffYWzszPt27cvoUgLL29y\nls3akjHI5CyVqICAAPbu3WvyNZpLu3Xr1uHh4UFmZibXrl3L9wzkZ1FgYCB///03HTt2JCAggE8+\n+eShiW3hwoWoVCq++OKLUvmo0bx9zrLmLBlD6ftfLz3X3NzccHFx4fTp06YOpVTS6XR07tyZ3r17\n89577/HPP/9QuXJlU4dVbCwsLBg+fDhnz54lKSmJWrVqsWLFCoM/1tLS0pgyZQo2Njb06NHDhNE+\nnGzWloxNJmepxAUGBsqm7QKcPXsWNzc3du3axZ9//sl3331n6pCMpmLFiixevJhNmzYxb948/Pz8\nOHHiBABLly4FYOLEiZibF+Vhl8Ynk7NkbDI5SyVO9jvnN3XqVOrXr0+1atWIjY016lKYpcnLL7/M\noUOHePfdd2nTpg3vv/8+EydOxMzMjH79+pk6vIeSU6kkY5PJWSpxAQEB7NmzR/Y7A8nJybz88suM\nGzeOGTNmcODAAWxsbEwdVokyMzPj3Xff5fz581y5coU7d+4QGBhYamvNIGvOkvHJ5CyVuCpVquDk\n5PTYEbvPo6ysLI4fPw7Arl27cHV1JSoqinPnzjFixAgTR2da9vb2XLp0CXt7e27evEnjxo3Zv3+/\nqcMqkEzOkrHJ5CyZxHPzCMnYWJgxA/r2hfbtlX9nzFCe/PSAyMhIAgMD8ff3p3v37rRq1Yq2bdty\n8+ZNatSoYYLgS5c1a9aQnp7O2LFj2bNnD5999hk9e/akf//+3Lp1y9ThGZBTqSRjk8lZMolnflDY\n0aPQpQt4eUFICKxeDVu3Kv9OnAienkr50aMAbNiwgQYNGrB//35SU1PZuHEjq1evZv369aVyqlBJ\ny87OZuLEiaSnpzN48GBUKhW9e/fmwoULVK5cmXr16jFr1iwyMzNNHSogp1JJxid/K0gmkdvvXNjV\nokqV+fMhMBA2bYK0NOWVl1ar7Nu0CREQwMpXX6VHjx4GNSwhBOHh4SUbdym2fv16UlJSCA4Oxt7e\nXr/fzs6OadOmsX//fv744w/q16/Prl27TBipQjZrS8Ymk7NkEp6entjY2HDhwgVTh/Jk5s+HkSMh\nNRUe94eFEKi0WrocOMDAB4ratGnDRx99ZLQwnyU6nY6QkBBSU1Mf+p3UqFGD7du3M336dAYOHEi3\nbt2IjIws4Uj/lZucNRoNmZmZpaZGLz0/ZHKWTOaZ63c+evTfxPwEbIFZwEsojxr89ttv2bp1KxUr\nVjRGlM+c//3vfyQmJjJo0CDKly//0ONUKhUdOnTg7Nmz1K9fn0aNGjF58mS0Wm0JRqvITc4qlUrW\nniWjkMlZMpnCzneeN28ejRs3Rq1WM2DAAIOyxYsXU61aNezs7GjdujU3b97Ul82cOZO6detib2+P\nj48PM2fOfOg9MjIy6NatG97e3qhUqgL/aDgxahT+qanYAa7A/+UpOwk0BxwBd+DBZ0ZZA1/Z2XHo\n0CE+/PBDxo8fT5UqVXB0dCQwMJCzZ88+NLbx48dTr149LCwsmDhxYr7yNWvW4OXlha2tLZ06dSIu\nLk5fFhcXR+fOnbG1tcXLy4s1a9Y89D6mIIRg4sSJpKSkFHq0ukajYcKECRw/fpxTp05Rp04dfv31\n1xLtIslNzoBMzpJRyOQsmUzuoLDH/VKtXLky48aN45133jHYHxYWxpgxY9i8eTNxcXH4+PjQu3dv\nfbkQghUrVhAfH8/OnTuZN28eP/3000Pv4+fnx6pVq3Bzc8tXdvf8eVr/9RcDgXtABPBmnvL/Av5A\nHBAGzAd+zVNuDrTMzKShuzsbNmxgyZIl7N27l7i4OJo1a/bIBTeqVavGjBkzaNu2bb6ys2fPMnDg\nQFauXElMTAw2NjYMGTJEXz506FCsrKyIiYlh9erVDB48+JF/CJS0LVu2cOfOHQYMGFDg9/4o3t7e\nbNy4kR9++IFRo0bRpk0bLl26ZKRIDcnkLBmdkCQT0el0wsPDQ1y8eLFQx48dO1a8/fbb+u0RI0aI\nIUOG6Ldv3LghABEREVHg+cOHDxfDhg177H2qVKki/vrrL4N9o197TfQ1MxNC6WnO99KAOJtnuxuI\nrx48TqMRYsYMMW3aNNG9e3f9tcPDw4VarX5sXH369BEhISGGcY0eLXr37q3fjoiIEJaWliIpKUkk\nJycLS0tLg++3b9++YtSoUY+9V0nQ6XSiQYMGws7OTkRGRj7VtdLT08XXX38tnJ2dxahRo8T9+/eL\nKcqCrV27Vv8zbN68uQgLCzPq/aSyR9acJZNRqVRPtZSnEMKg1p37vqBR0EII9u7dS506dYp0r0Pn\nzlFep+MVoCLQHojKUx4MrAAygYvAQaDFgxfRauHMGXr16kVERASXLl0iMzOT5cuX07p16yLFdfbs\nWRo0aKDfrlq1KlZWVly6dIlLly5hbm5O9erV9eUNGjQoNTXnnTt3cuvWLbp3746np+dTXcvKyooR\nI0Zw5swZbty4Qa1atVi7dq3RmrplzVkyNpmcJZN6mkFhbdq0Yf369Zw+fRqtVsvkyZNRqVSkFjBg\na+LEieh0OoKCgop0r+vJySxH6WeOAnyA3nnK2wE/AxqgJvAu0KSgC8XHU6lSJZo3b06NGjXQaDRs\n2LCB2bNnFymu5ORkHB0dDfY5Ojpy//79R5aZmhCCkJAQtFoto0ePLrbrVqpUiZUrV7J27VpmzJhB\nYGCgUZ6AplarycjIAGRyloxDJmfJpHJrzkWp4bzxxhtMmjSJrl274uXlhbe3N/b29ri7uxscN2/e\nPFasWMG2bdtQq9VFilNjaUlnlIRrDYQAB4BElH7m1sAEIA2IBn4Dvi/oQuXKMWnSJI4ePUp0dDRp\naWmEhITw+uuvF/hHxePY2dnlSwxJSUnY29s/sszUQkNDuXbtGm+99RYvvPBCsV/fz8+PY8eO0atX\nL1q0aMGHH35IfHx8sV3/wZqzXCVMKm4yOUsmVa1aNYQQXLlypUjnDx06lMuXLxMbG0vXrl3Jysqi\nbt26+vIlS5Ywbdo0QkND8yXtJ1HfxwdVngcxqHL+FcAVlAFf/QELlNHavYDtD15Eo4F69Th16hQ9\ne/bE3d0dCwsLBrRpQ/zt25zr2vWxS4A+qE6dOpw6dUq/feXKFdLT06levTrVq1cnKyuLy5cv68tz\nRzeb2qRJk0hPT2fcuHFGu4e5uTmDBw/m3LlzZGRkUKtWLX788Ud0Oh1ZWVls3ry5yM3eeZOzXCVM\nMgaZnCWTKky/c1ZWFmlpaWRnZ5OdnU1aWpp+X3h4OEIIoqKi+OCDD/joo48oV64cAKtXr2bMmDHs\n2rULX1/fx8aSnp5OWs5qXxkZGaSlpel/eQeNHcsv2dmcROlX/gLwA5yA6ihJeg2gA24D64AGD95A\nCBgwgCZNmrBhwwZidu5E17kzK93dyUxLo9rOnQUuAZp58CBpaWn6pJL7XQD06dOHLVu2sHfvXlJS\nUpgwYQJdunTB3t4eW1tbunTpwoQJE0hJSWH//v1s3rzZ5I9iDAsL48KFCwQEBFCvXj2j369ChQos\nWLCAbdu2sXjxYpo2bcro0aPp1KkTAQEBBn/cFJbsc5aMzkQD0SRJb8GCBaJ///4PLQ8JCREo+U//\nCgkJEfHx8aJevXrCxsZGuLq6is8//1xkZWXpz/P29hYWFhbC1tZW/xo4cKC+vHbt2mLVqlX6bS8v\nr3z3uXr1qr58Vo0aojIIJxDtQETlGYkdCqIxCAcQriDeA5GSUxYJwhbE5TfeEEIIodVqxRB/f+EG\nwh5EQxA78lxrYM5LgBAqlXjb3DxfXEuXLtXHtXr1auHh4SFsbGxEhw4dxL179/Rl9+7dEx07dhQ2\nNjbCw8NDrF69+ml+VMXitddeE+XKlRNHjhwp8XtnZ2eLOXPmCJVKpf8uzczMxNChQ0VcXFyhr3Pq\n1ClRt25dIYQQc+bMKdQsAEl6EjI5SyZ3/vx54enpaeowHuno0aOihaOjSHvIVKrHvTLNzETrChXE\nzz//LMT33wthY1Poc98GMdbCQjnvGXfgwAHh7Ows3sj5Q8UUBg4cmO+PHUBUqFBBLFy40OAPvIe5\ncOGCeOGFF4QQQixfvlz069fP2GFLZYxs1pZMrkaNGqSnp3Pt2rV8ZaVhdbCwsDACAgI4lJiIM0++\nOhiAhbk506ZN47MBA7AbMgS7nJXG1MCjhmd9APwCfJmVxbLgYDh2zKB89uzZuLm54ejoyDvvvKNv\nagW4du0ar732GjY2NtSsWZM//vjjEXcqGZMnT8bMzIzx48ebLIYRI0bQpk2bfPvv3r3LBx98QNOm\nTTl8+PAjryGbtSVjk8lZMrlH9TubenWwbdu20apVK1JTU3kXiOXJVwcDICuLBtu3c+n110kCknNe\nvYHuj/huGgBNATeAjAyYOlVf9ttvv+kHu127do0rV64QEhKiL+/duzcNGzbk3r17fPnll3Tr1o07\nhRhkZixHjx7lyJEjVKtWDX9/f5PF8cILL7Bt2za2bNlS4FiEY8eO0bRpU9555x1iYmIKvIY+OcfG\nUmf7doYeOvTEg/kk6ZFMXXWXJCGE+O6770RQUNBDy02xOlhcXJxwcHAQgFCDSC3C6mBLcvqnBQih\nVouqILrnbCeDUIFYBOI8iBYgyoGoDmLdA83abiBqg7AD4d+smbh27Zro3bu3GD16tD72P/74Q7i6\nugohhLh48aKwsrISSUlJ+nI/Pz8xf/78x34HxtK+fXvh5uYmtm/fbrIYHqTVasWUKVOERqMpsKnb\nwcFBfPvttyIzM9PgvIRdu8QWS0shrK1FtlqdfyU4a2shOncWwgT96tLzQdacpVLhSVcKEyWwOli5\ncuXo1asXAHWA13jy1cECgL0oo7ij0tPJBPbnlM1HmZLVC2iJUgOPBdYCQ4C863jFAh2Au9bWvGhm\nRp8+ffKtDtagQQNiYmK4d+8eZ8+exdfX12BOsylXBzt58iT79u3Dzc2tyKuhGYO1tTVjx47lwoUL\ndO+evw0jKSmJ4OBgGjZs+G93x4wZOLRpQ5vMTEhLwyxPVwJg8DxvAgOVx4xK0hOSyVkqFWrXrk1S\nUhLR0dGFOr4kVgebOHEiixYtwt7engvAXJ58dTBflD7lkyiLlrQCqgAXgCVANWAb4A0EocyTbgR0\nzblmrvJADUCdlkaDgwfZv38/4eHhBAcH06BBAyZPnqxfDaw0rg42ZcoUbG1tGT9+PCqV6vEnlDBP\nT0/Wr19PaGgotWvXzlceHh7Op6+9xlUnJ8SoUagyMx//y1MI5fGiI0fKBC09MZmcpVJBpVLh7+9f\n6NqzsVcHGz58OF988QWLFi3Cx8eHLm5uRV4dLADYDezJeR+IMsjrAkoSjgQOo8yZzn2tRpkvnStv\n5BV0OgB0Oh23b9/m9OnT7N+/Xz+ISavVYm5uXmpWBwsPDyc0NBQ7Ozs6depU4vd/Eq+//jonT57k\nm2++wcHBQb9/IMrPzzsxkYL+tFChjEUoUG6CfmAwnyQ9ikrkbRuUJBOaO3cup0+fZtGiRfnKxo0b\nx/Xr11m2bFmB5166dImGDRty/fp1/SIkS5YsYcKECezZs6dQi5AAuLu7U6NGDXbv3s3PP/9M586d\n6devH5YHDrAkZxWzOMAZiEf5hdwy532ub4E/gK0524uALcBVYAdwChiD0gS+D7iMUove9ZCYBqDU\nrmfmvF+IkizysrKywtLSktTUVDQaDRkZGWRlZWFpaYmNjQ0ajYaEhAScnZ3x8fHBwcEBW1tbbG1t\nsbGx0b/P+3rcfrVaXahacO/evTl8+DCTJ0+mb9++jz2+tLh9+zaff/451suXMwuwfcSxKpSfY7WH\nHqCCzp1h48biDlN6TlmYOgBJyhUQEMDcuXMN9mVlZZGVlWWwOpiFhQVZWVlERERQp04doqOjH7o6\n2F9//VXo1cGEENy9e5dbt27pR2kD9OrVi54//cT7QGMevjpYL5S+4XXA63k/F/AJSn91RZRpV+GA\nFdAQpbn6c2BlzjVAaQa3A6oC2Sh/EJxDqU0vKCD+wMBAoqKiqFKlCv7+/iQmJrJy5UocHByoVKkS\n0dHRpKenk5KSwuHDh8nOzkaj0aDRaFCr1frkbm5ujpmZmT7pCiHIzs4mMzOTzMxM/cppqampZGdn\nGyTwgpJ57jKZGo2Gq1ev8u233xb6DwALC9P+enJzc2PZ0KFk//QT5g/2Kz8pIWD7dmUUt4tL8QQo\nPddkzVkqNXQ6HS4uLpw5c4bKlSsDSr/vpEmTDI4LCQkhODgYf39//vnnH+zt7QkKCmLKlCmY56x/\n7ePjw/Xr1w2asvv27cuCBUpqq1OnDmPGjKFPnz4AeHt7ExkZaXCfK1eucPz4cT7++GMSrl/HHtCi\nJObvAY+c4/4ERgGXUPqd26PMg7ZB6aOunfO+NfADSuL1Q0ngubXliygJfBfKX8xNgW9QBps92NDv\nUq4crwYEkJWVxdmzZ7l58yYWFhZ0796dBQsW6D/ztWvXGDBgAIcPH8bT05PvvvuOFi2UoWoZGRkk\nJiYW6pWQkFDg/szMTOzt7fUP2citoavVatRqNZaWlvz999/cu3ePWrVqUbVqVX2yz034aWlppKSk\n6F+pqan69xYWFk9cmy/sfo1G89Ba//Tp05kzZw5JSUnYZWbinJ7OEuAj4HzOz7hrzs/HKuecvDXn\ndGAssD7nfWdgNqDRaLj72WcMOHaMffv2YWZmRp06dQgLC8PMTPYwSoZkcpZKlU6dOtGzZ0+DOcvG\nlpWVRYMGDbh27RonTpygRo0aXLp0ieHDh/P777/rj9sIdER5yMWTygY2ofwSL+o1SlvT6OMS/NWr\nV1mwYAFmZma89dZbJCUl5TsmKysLBwcHHB0dDV4ODg7Y2dmh0WiwtrbG2toaKysrLCwsMDc3N0is\nmZmZBkk97/uHJf60tDQ0Gk2+pK1SqTh16hQtW7bEx9aWyj/9xHqUroRMlJaT68BbKF0LwTkx5E3O\nwSgPQ1kGWKKMwq8LTAVG16lDvJ+fvoXo0KFD+Pn5Fap7ICsry+StCVLJkT9pqVTJnVJVUsk5NTWV\n2rVrk5CQwMWLF3F3dyckJISpU6eSmZlpcOxUoLVKhU1R/p61tubIK6+wb+9eWmVmPrL/8qE0GijG\nZx8/LSsrK1xcXHB5SDPte++9h7e3N4MGDSI4OLjAYwpbg4+NjX1oTf7BBK9Wq4mMjNQ/IrJu3bpU\nqVKFpKQkRowYgaOjI8nJyXTr1o09e/ZgbW3NL7/8wvz587l37x4ZGRmoVCr+c/cu76Ak5QCUX5YJ\nQDmULodRKDXi9/N8nqUoo/r7o4zUL4/SZTEWWAXEnT9PDSsrIiMjqVatGi+//DKffvop69evJz09\nnc6dOzN79mw0Gg27d++mb9++DB8+nNmzZ9OyZUtWrlz5lD816Vkhk7NUqgQGBrJw4cISuVdCQgI1\na9ZEp9Nx5coVypcvDyijmh9MzBYWFrz+ySeYVaoEY8cqI3ALy8YG86+/ZvrgwaSlpXFy0CAarFiB\n5kmSvI0NfP01NG5c+HNMKDIykp9//hlLS0vef//9hx73uARfGHkTfFxcHL1796Zx48a0a9eO+/fv\nc/78ec6dO8e9e/fYsGEDiYmJ+pW/2rRpQ2JiIunp6Tg6OlK5cmUyMjL4888/+TMlhQYoc9RXo3Q7\nuKH0/+uAl1HGGuRdLe5+Ttk6lCbvm8AglJaSZGBH8+b0OHCAli1bolKpqFSpEs7Ozpw8eRJLS0v+\n+9//MnnyZKbmrAR3+/Zt4uLiiIyMRJczSl8qI0yy9IkkPURWVpZwcnISt2/fNup9bty4IZycnISH\nh4e4f/++fv+pU6dE06ZNhaWlpX6VqNdee02cO3fu35NzH1yhUj3ygRVZIHQ2NgU/sOL770W2tbXI\nfsxDL7JAZFhaisTp0436fRS3QYMGidq1a4uvvvqqRO974MABUaFChXwreoWEhIg+ffrot69evSoA\nkZmZKZKTk4Wjo6P48ccfxZkzZ8SxY8dEaGiouPjii+I/IFxAvA5iBIh4EFYgRoF4NedntCDn/8ll\nED/mrPp2PafsdE7Z7dyVw2bMEOXLlxd///23OHPmjADEihUrDOL39vYWQgjx119/CUtLS6HVakvm\ny5NKFTkKQSpVzM3N8fPze6LVwp7U5cuXqV69Om5ubkRERGBnZ0diYiLBwcG0aNGCoKAgli5dSqVK\nlVi7di2hoaHUqlXr3wsMHgxhYUr/r7W10tycl0ajNGNXqsSiPn2U4x80eDBme/di1qVLgdfItrIi\nw8yMLWZmdHF2pvLkybRu3ZrVq1eTnJxshG+l+Ny4cYO1a9dy69YthgwZUqL3jo6OxsvL64n6Zm1t\nbVm3bh1r166lWbNmDBkyhAoVKuBdsyaWKP3J9wEHlLnsGcD/8pzvlee9GUrt+mOUkfu5P9WTAEKw\ntXJlLC0tuX//vr51ZvDgwTg5OeHk5ETr1q0N1j93cXHB2tr6yb4E6bkgm7WlUie337lHjx7Ffu0T\nJ07wyiuv0KBBAw4ePIhKpWL16tV8+umntG3blnPnzlGhQgWEEHTs2BE7O7uCL9S4sTIw684dWLYM\nzpyB+HgoVw7q1YMBA3BPS6N9w4YEjhxJ9erVn+ga5vXqYT5gAIGWltxcs4aoH37g+PHjXLlyhSFD\nhtCuXTv69OlDy5YtsbS0LPbv6WnMmDEDT09POnbsmG+VMmPz8PAgKioq3+ApW1tbg9Xjbt++bXBe\nq1ataNWqFUeOHKFDh8ow5rkAACAASURBVA40atQIBysrPFUqPIXga5QnhM1ASdZvAGdyzo3CkDfK\nwLCmKAkalNH4rdq04XJsLHfv3uXNN9/E2dkZCwsLLl68SJUqVQr8PKVxNTWphJi66i5JDzpy5Iio\nU6dOsV83LCxMWFhYiFatWgkhhDhz5ozw9/cXjRo1EgcPHiz2+wkhxDfffCNef/11odPplB0xMUJM\nny5Enz5CtGun/Dt9uhCxsY+91vHjx8WQIUOEk5OTqF27tqhRo4ZwcXERQ4cOFQcPHvz3HiZ069Yt\n4ejoKBwdHcWdO3dK/P5ZWVmifv36YsSIESI5OVlotVqxb98+8fvvvwtnZ2cRGRkpEhISRIcOHfTN\n2rdv3xabN28WycnJIjs7W0yYMEEEBAQIERMjdlhaCi8Q6Xm6GvqA6AQiCcQ1EDVyHl4iQCzN09wt\ncpq6AaUb5OhRIYTycJW9e/cKIYT48MMPRffu3UVMTIwQQojr16+LnTt3CiGUZu0qVaqU+HcolQ4y\nOUulTmZmpnBwcCjWX+6bN28W5ubmomfPniIpKUmMGDFCuLi4iO+++05kZWUV230elJmZKV588UWx\nbeJE5SlF1tbK6ymeYpSSkiJWrFgh/P39hbOzs3j11VeFj4+PqFq1qhg/fry4cOGC0T7P44wYMUI0\naNBAfPLJJyaLITIyUnTs2FGUL19eODs7i+HDhwshhBgyZIhwdHQUVatWFQsXLtQn55s3bwp/f3/h\n4OAgHB0dRUBAgDh79qwQQoj0jh1Fm5ynhTnn/LzichJ0BRDu/8/efcfXeL4PHP+c7ESGiBgJIsSM\nhJotQhB7JrESoqFqtlotPzXjW7OK1uhQqqQRo9QoatZMtWYQo/aIFSNEyD7X74+TnCaSEIoM9/v1\nOi/Jedb1nESu576f+7lukP+BfuxAdsk5ac4cfXzpk3NcXJyMHDlSnJ2dxcrKSipXriyzZs0SEZWc\n33QqOSt5UuvWrWXVqlUvZV+LFy8WAwMD6d+/vyxdulQcHR0lMDBQ31p51S7+3//JIxDtMwaQiUaj\na2FlNYAsG//884+MGDFCihUrJjVq1JCWLVtK8eLFpVatWvLVV1/JjRs3XuGZZRQVFSWFCxcWGxsb\nuXbt2ms77iu1f7/uZ/KMgXvZvbSmpvKtu7u0b99e4uPjc/tslHxEFSFR8qQvvviCa9euMXv27P+0\nn1mzZjF06FDef/99zp49y7179/jmm29o0KDBS4r0Gb77TjfpwXM+esX06VkPJMtGUlISGzZsYMGC\nBYSFhenPLywsjDp16tCjRw98fHxezsQXUVG6e+THjsGDB2BjA+7uTLx2jV/37OHtt9/m22+/feZu\n8o0X+BkKEF+pEuYhISS6u+Pn50d8fDyrVq1SA7yUnMntqwNFycq+ffvE3d39P+0jKChINBqNeHp6\nStGiRWX27NmZHrF5pf5LqyvdPcrndfXqVZkwYYI4OzuLm5ubBAYGSqtWrcTGxka6desm69atk4SE\nhBc7n2y65rVmZhIHss7ISK6tWfNCcedpOXx8TkDEyEgO+/lJ8eLF5e+//xYRkcTEROnatau0aNFC\nHj9+nMsno+QHKjkreVJiYqJYWVnJ3bt3n2u7OXPmSK1atcTAwEAAsbW1lYCAAJk7d64UKlRI/zI3\nNxdADh48KCIi06ZNE1dXV7G0tJSyZcvKtGnTsj3Gvn37xMvLS2xtbaVo0aLSuXNnuX79un55q1at\ndMcxNJRCIMYg1bL5Q74PxCv1nmZRkM4g19O6uH185KuvvtLfjyxZsqR8/PHH+guMW7duSffu3aVk\nyZJibW0t9evXl7/++ksfR0pKimzbtk26d+8uNjY24uHhIaVKlRJDQ0MxMDCQAQMGyN69e/UDycLC\nwqROnTpiaWkpbm5u+vuiIpLj5JSSdmHxHF3z+caBAyI+ProLE3PzrMcN+PjoL6rWr18v9vb2sn37\ndhHRjT/w9/eXZs2ayaNHj3LzTJR8QCVnJc9q0aKFrMlhKywlJUUOHz4sq1atktq1awsgFhYWsmvX\nrizX/+mnn6RcuXL6xPTFF1/IoUOHJCkpSU6fPi1lypSRpUuXZrntxo0bZcWKFfLgwQN59OiR9O7d\nWz8CXO/WLX3rsnHqoKGsktlGkBUgD0AegfQGaZm23MxMzv39t0RHR4uIyN27d6VJkyYyY8YMERE5\nf/68zJgxQ65fvy7Jyckyb948sbOzy1BUJc2dO3dk6NCh4ujoKPb29mJtbS0DBgwQQJycnGTo0KFS\nuHBhWbFihSQnJ8vPP/8shQsXlnv37v2bmJ+35f8fEnT//v3l888/z9G6jx8/lnbt2om1tbV07tz5\nhY+ZY1FRItOmiQQE6EbcBwTovs9ixP3OnTvF3t5e/3ucnJwsvXr1Ek9Pzyx/ToqSRiVnJc+aNGmS\nfPzxx89cLzExUXr27CkmJiZSokQJAaRmzZoSEBCQ7Taenp4yfvz4bJd/+OGH8sEHH+QozkOHDoml\npWXGN7/4QsTMTC6CGIBcyGFSOwRimdYKNTOTx//7n76lfOfOHWnWrJkMHDgw21isrKz0vQFZ0Wq1\nMmfOHLG0tBQrKysBZPr06dKpUycxMjKSGjVqyJdffimRkZFSoUIFWTB6dK50zT+P4OBgqVOnzuu9\nZfEcDhw4ICVKlJCff/5ZRHQJuk+fPuLh4SExMTG5HJ2SV6kKYUqelVaM5Gni4+Pp3LkzISEhJCYm\ncvPmTWbMmEHr1q2znYbv8uXL7N69m169emW5XETYs2cPrq6uOYpz9+7dGdZNSUkhJiwM4uMJRjd/\ns3OO9gS7gbQ9GcTH80tQEMbGxmg0GooWLcrRo0fp379/ltuGh4eTmJiIi4tLtvvXaDRUrlwZOzs7\n9u3bB8DKlSvZtWsXNjY2fPLJJ5w6dQo3NzciIyP584cfkLi4HEb/hLg4SK0R/aRFixbRsGHDDHGd\nO3fuhQ5z+fJlKlasmGdnbKpduzbbt29n5MiRzJ07F0NDQ+bPn0+VKlVo1aoVMTExuR2ikhfl9tWB\nomQnISFBylpYyOPx47Ms2hETEyPvvPOOoBscq39VrVpVRo4cKe+++26W+/388891RSayMW7cOHF3\nd3/moy9arVY2b94slpaWMnDgQHn33XelVq1aYm5uLutSW4/l0T37mpOW5tHUe8+7Qa6B+IBYpzuv\nwMBAqVixotSqVUuaNGki5ubm4uLiItu2bZNPP/1UDA0NxcbGRjZv3qyPsXHjxvLZZ59JnTp1xNra\nWjp06CCrVq0SJyenDPWlw8LCxMTERAwNDcXIyEjfqu4LcgPEHOROulgPpt4jT0z9/keQyiCFQVqg\nK84hIGJiIqfCwvT36CtWrCjLly+Xn376SRo0aKCPE5CzZ8/qv3/33Xdl9OjRIvLv877Tp08Xe3t7\nKVGihCxcuFD/szI2NhYjIyMpVKiQLFiwQFJSUmTChAlSpkwZsbe3l4CAALl///6zft1euYsXL0r5\n8uVlwoQJotVqJSUlRQYNGiT16tXT37pQlDQqOSt5U+rI4HgDA0kyMck0+EZraiobzcyk9hOJ2dnZ\nWc6dOyejR4/ONjm7uLjo/7g/ac6cOVK2bFm5evXqU8OLiooSS0vLTBcGaa9gkD0ghUAe5iAxnwVx\nSN0uBaQmuvvUP6bbp6mpqX5CjiJFioiDg4OYm5uLgYGBaDSaDK+SJUtKhQoVxNLSUkxMTMTDw0N8\nfHzEyclJSpUqJTY2NjJ8+HABZMGCBfLLL7+Is7OzFC5cWMzMzKRw4cJiAPJuanytQb5NF+/HIB+k\nfr069SLkJEgSyASQt1OXxWo0UsrGRhYuXChJSUly6NAhsbOzk4kTJz5XcjY0NJSxY8dKYmKibNiw\nQczNzXX3wyXzpBY//vijlC9fXs6fPy8PHz4Ub29v6dmzZ45+7V6169evi5ubm3z66aei1WpFq9XK\nkCFDpHbt2s89+FEp2FS3tvL6RUXBtGnQsye0b6/7d9o0XY1p0D1X6ukJa9ZgqtVilJiYcfu4ODQJ\nCbSIj2cnuknvAapWrcrevXspX758tocOCwvj+vXrdO7cOdOyhQsXMnXqVLZv306pUqWy3cedO3fY\nvn07jx49ynadY8CPgA+6uX+f5jLgBYwFAoADwG1gGHAy3Xpt27alfv36mJmZMWXKFAYMGEDjxo0R\nEezs7KhQoQJWVlaIiL62tIGBAY6Ojtjb22NhYUGtWrWIjIzk8ePHzJs3D4DJkyczf/58Ll68COie\nmX7w4AEA51OPXQkYnvp1CrAU3SQPnYB5QHFgNtABmAwcQVd7urUIN2NiGD9+PFOnTqVGjRr4+vpy\n4MCBZ3wqGRkbGzNu3DiMjY1p06YNlpaW/PPPP1muu2TJEj755BPKlSuHpaUlU6ZMYdmyZSQnJz/X\nMV+FkiVLsnPnTsLCwnj//ffRarV8/fXXNGrUCC8vL+7evZvbISp5RN68SaMUTAcO6O5B/v677vv4\n+H+X/forBAVBpUrwzz8Zl2XDECgEzACcypSh3+7d2NjYEB8fT0pKCikpKcTHx2NkZKS/H7l48WJ8\nfX0zFeNYsmQJo0aNYseOHZQrVw7Qzet88uRJIiIiMrweP35MUlIShQoVynaGqLWFCxN1/36G2Yuy\ncg1oCgxGN+8v6JL1dcABiDM2xtTAABHh9u3bnDp1irJly9KvXz+SkpLw8PDAzMyMGzduYGRkRHJy\nMsbGxqxfvx4DAwN69+5N9erVcXV15ebNm/oLiqSkJH0xjCtXrhAdHY2RkRGurq5Uq1aNo0ePcuyv\nv0hLf+OBWcAWdPMV26C7Pz4G3UXFWeBPdBciJkACumR+B9CIEB0dTVBQEJMnT8bAwIC6des+45PJ\nKG2SiDQWFhbZfvbXr1/HyclJ/72TkxPJycncunUr2wkmXqciRYqwdetWvL296d69OyEhIUyfPp2R\nI0fStGlTtm3b9p/mt1YKiFxuuSu5LO25YBMTk0zdwPPnz5fy5ctLoUKFpGXLlhlKMj7Pc8EJCQni\n+9Zb4qTRCCA7shml7JHaDVwM5Ot0y46ANEy9/+pI1o8lac3NRQ4ckHHjxmXqYk4b3RwXFyc2Njay\nbds2fWxjxowRV1dXAUSj0YixsbEYGhqKRqPRPyttZGSkXzZz5kwJCgrKsivb3t5etm3bJjdv3pQl\nS5ZIGXNz0WYRa1WQkNSvx6duWyjdywzEBUR8fCQwMFCKFSsmFhYW4uTkJO+88450795dRHSP6aTF\nnfb8toWFhQBy9epV2b17txgYGMiIESNERNc9nFXcP/74oxQtWlQA/TPQhoaG0h7dM9ppcVcBaQTi\nD/Jh6v3l+NR7zB4gAenWTUY37/E0EC8zMxER+f777/X3+l/knnN6Tk5OsnXrVhHJ3K3dtGlT+eab\nb/Tf//PPP2JkZJTnRnPHx8eLt7e3tGjRQmJjY0Wr1cro0aPF1dX1lc9nruR9qlv7Defg4MCYMWPo\n06dPhvd37drFqFGjWLt2Lffu3cPZ2Rk/Pz/9chEhODiY6OhoNm3axNy5c1m2bFnWB5k3j4YREYSI\nUCKLxXeAVui6p+8C54AW6Zb7A42Ae8Au4Dtg3RP70MTHw5QpuLq6UrJkSc6fP09ycjKfffYZf/31\nF6CbK/rPP//k7t27jBs3Dh8fH+bPn8+ZM2ewsrLC1dWVoKAgVq1axdmzZ9m6dSuOjo4kJSWh1WpJ\nTExk6NChjB8/HhHBw8ODH374AdGN3SAqKopmzZpRvHhx/P39ubxrFxoLi0znewLokfp1ELoMGfvE\ny1qj4QsHB7799luuX7/O33//zS+//EKLFi0wNDQEdKPZt27dSpkyZYiNjSU2NlbfHQ3g4eGBh4cH\nISEhnDx5krp16+Lt7Y2ZmRmDBg3C398fgMGDB3P37l3s7OwoUqQIRYoUwcTEhPVAErpubICP0LWO\n16W+3xUwRdfiPw6kFaV8ACxEN+9xAHAmOZmff/4ZR0dHIiMjOXDgANevX8/iN+Hl8PPz46uvvuLi\nxYvExsYyatQounXrludGc5uamrJixQpKlixJixYtePDgARMmTKBLly40adKEGzdu5HaISi5SyfkN\n5+PjQ6dOnbCzs8vw/m+//UaXLl1wdXXFxMSEsWPHsnv3bs6f192F7NixI++99x62trZs3ryZjh07\nEhYWlvkABw5g8tlnfJyUREN0XdFPmgm0RJewTAEroEq65ZdSlxkC5YGG6BJcBiKwcSMXjx+nQYMG\niAjr16/n0aNHHD16FDc3N6ytrfH29mb58uUAdO/enT/++INHjx7RoUMHfH19GT16NB07dqR8+fLZ\nPoqVxsDA4Onz7dapo6uRnUWCfhpDCwt+mzSJ8Dt3cHZ2pmjRovTt2zdD4s2JqKgooqOjqVChAh4e\nHlhZWbF27VpSUlIIDw/XzzE9b948HBwcqF27NjExMdy/f5+EhAR8U89fUvfXH91cxuWBDegSL4A3\nUA1YA1infv0nYIzugmqdhwfLli3Dz8+Py5cvM2LEiFd6/7dPnz4EBATQqFEjnJ2dMTMzY86cOa/s\neP+FkZERCxcupE6dOjRp0oSoqCiCgoLw9/fH09OTa9eu5XaISm7J1Xa7kmc8Obr5k08+yVDsIjIy\nUgB9paM+ffroC4RotVqpUaOGfPfdd5l37O2doeSjYxbd2k1AhoC8A2IP0g7kcrrlI0FGoHts53Tq\nPvZn0V0cb2goY4sXF41GIw4ODtK6dWupW7eu1KxZUw4fPvzUmsY9evSQoKCgDO/t2LFDjI2NpVix\nYlK2bFn5+OOPJTY2Vr+8cePGUrRoUbGzs5P69evLjh07st55Tusyv8CsVCK66mhnz56VX375RUaN\nGiVt2rQRBwcHKVy4sBQuXFi8vLxk8eLFEh4eLidPnhR7e3spVqyYtG7dWsqVKycGBgZSrFgx/RzR\n69atk4iICOmU2t2flC5G59TP3/mJ2N8FGf3Eez1AOoL8n6mp9OnTR8qXLy/z588XkWd3a79ptFqt\njB8/XipUqCCXL18WEZGpU6eKi4uLXLlyJZejU3KDajkrWWrTpg0rVqzg2LFjxMXF8fnnn6PRaHj4\n8CGgK/yQVnhj/PjxaLVaevfunXEnUVG6wV8iGd5OybgWkcBidAOOrqAr2OGXbnk7YCVgDlQG3gPq\nZBGzaUoK/atXp3///ly/fp0tW7YQFRXFypUreeuttzA3N3+uz6By5cqEh4dz48YN/vjjDw4dOsQn\nn3yiX/7FF19w4cIFrl27Rr9+/Wjfvr2+ZyGDgQNh1y7w9gYzM3gyDnNz3fve3rr1njIbVUJCAocO\nHeLHH3/kww8/pGHDhhQuXBgvLy9CQkIwNjamX79+rF+/nlWrVlG0aFHi4+P1M3G1bt2a2NhYqlat\nyrFjx7h9+zb+/v5cvHiRrVu3UqJECfz8/PD29qZVYGCGYx9Ad9vhGv+2mp9mDmAB/JDafXvt2jXC\nw8OJjIzMwdZvFo1GQ1BQEIMHD8bDw4PTp08zYsQIBgwYgKenJ5cvX87tEJXXLbevDpTXx8nJSSZP\nnixVqlSRwoULS2BgoMTFxYmISNeuXcXW1lZsbGzknXfekaNHj8rcuXPFxcVFDAwMpGXLlmJgYCBG\nRkbSpEkTMTAwEFNTUzExMRFHR0c5ceKEBAQESNGiRaVMmTIyYcIESZkyRcTMTH4CqY/u2VgNSE/I\n8J4BupKVYanvl0wdqPQtyF0QK5ChINVTB0yZgLRJ10K7mLr+IhCr1CIaw4cPl6SkJPnpp5+kbNmy\nEhQUJOXKlRNLS0upWbOmvjVy6tQp8fLyEhMTEylSpIgsX748289v3759UqRIkWyXt2zZUmbPnv30\nH8Jz1GW+e/eu/PHHHzJz5kwJCAgQNzc3MTc3Fzc3N+nVq5fMnDlTNm3aJLt27ZLg4GAZNmyYtGzZ\nUj8RRoMGDcTBwUF69Oghe/fu1RfiSD+Y6pm8vUVAeqEbkDcv9Wd15mk9AKkvLcjxihWlSJEi0qtX\nL9m1a5cMGzZMbG1tZcCAAVKhQoUMk5GkvUJCQnIWWwH1008/SYkSJeTw4cMiIvL1119L2bJl5cKF\nC7kcmfI6qeT8BnFychJXV1e5cuWK3L17V+rXry+jR4+WQ4cOiYWFhbRp00aSk5Nl0aJF4uTkpK+Q\n5eTkJJUrVxZzc3P9iO3GjRvLu+++K46OjnL+/HkJCAiQDh06SExMjFy8eFFXl7lePZHUhGsIMju1\nS3RTuvcWpnZ/uoOUBhmEblYmUhPxLnSjgneAHENXoGN4aoJe/URy7gvSysFBhg8fLiYmJnLy5EkR\nETEzM5Py5cvL6dOnRavVSnh4uNy5c0diY2OlVKlSsnDhQvHz85N+/fqJnZ2dREREZPn5/fXXX2Jr\na5vt59uqVSuZNWvWc/9ctFqtXLp0SVavXi1BQUHSsWNHKVOmjFhZWUnDhg3lgw8+kPnz58v69etl\n5cqVMmnSJOnWrZtUrVpVzMzMxNXVVbp37y6TJk2S3377TS5duqSf0CO734McJ+cnpr2ckXob4lmJ\nWfi3tnZ0dLRMnDhRihUrJr6+vrJ9+3b57LPPpEiRItK3b185f/78c39mBd2qVavE3t5edu/eLSIi\nc+fOlTJlyrzRXf9vGpWc3yBOTk4Z7gtv2LBBnJ2dpW/fvlK/fn3p2bOnxMXFSVJSkr6KllarFUdH\nR6lUqZKMHDlSv23lypXF2tpaTp48KcnJyWJiYiInTpzQL//++++lcZEi+uRcCiQuNTlvBvkBXVUp\nAdme2joG5Gpqa7ohSBF0VbZsQJakJuYb6KpP1UldL31yvmpmJuObN5cGDRpIjRo1ZMmSJRIcHCwa\njSbL1tiyZcukfv36EhcXJ35+fjJ69Gjp06ePjBs3TkR095wvX74sWq1Wrly5Ip6enhIYGCgiItHR\n0bJp0yb95xUSEiIWFhZy+vTpp/4MEhMT5ejRo7J48WL5+OOPxdPTUwoXLiwODg7Spk0bGT16tCxe\nvFiWLl0qc+bMkQEDBkiDBg3E2tpaHBwcpGXLljJ8+HAJDg6W8PDwZ5YYze73IMfJWUR/z9wJpAzI\n4Zwm5ifuncfGxsrMmTP14wE2bNggY8aMkSJFikhgYKCcOXPmuc+lINu6davY29vLxo0bRURk3rx5\nUqpUKfnnn39yOTLldVDJ+Q3i5OQk69ev138fEREhhoaGmZ57NTU1FTMzMyldurRYWFiIgYGBdOvW\nTZKTk/XbmpmZiaGhYYZna/v06aNfXqZMGSmeOmXiTyCmZH6+tla6P+bjU98rjG5A2JXURL4nNXlX\nSW1pa9A9e2uCrnv8MohF6rZJpqYSd+WKDBo0SExMTMTMzEzeeustMTExkePHj4uIbirC/v37i4hu\nmkhN6rPX6V+enp4iIjJjxgx9icxSpUrJBx98oJ9FKCoqSmrXri2WlpZiY2Mj9erVky1btmT4vB88\neCB79uyR2bNnS58+faRmzZpibm4ulStXFj8/P5k8ebLMmzdPvvvuOxk5cqS0bdtWypQpI4UKFZK6\ndetK3759ZdasWbJjxw65c+fOq/mlyKmXOKgtPj5evv/+e3F2dpbGjRvLqlWrJCgoSOzs7KRnz55y\n6tSp13hieduff/4pxYoVk2XLlomIrjSpo6Oj+ozeACo5v0GebDlv3LhRypUrJ/369ZOJEyc+dbsn\nW1qNGzfWj7xNTk4WY2PjDC3n7777TuqVLCkJhobyE0iDJ/6IP/ne2dTEmH6dtOQsIOVAZqa2vgXk\nI3Td4elbzkmdOmUZX8WKFbOcFzo0NFS8vLxe7MNMR6vVSmRkpKxfv14mTpwovr6++uIt9erVk379\n+snUqVPlq6++kokTJ0rPnj2levXqYmZmJhUrVhRfX1/53//+J7/++qucO3dOUlJS/nNMr8SBAyI+\nPrp5qs3NMyZlc3Pd+z4+OZ4mMikpSYKDg6VKlSpSp04dCQkJkQkTJoi9vb10794929sLb5qjR4+K\ng4OD/PDDDyIismjRInFwcFCfTwGXt57KV165b775hnbt2mFhYcHkyZPp1q0bPj4+eHt74+XlRd26\ndXn8+DE7d+6kUaNGmcpcZsXQ0JCuXbsyevRohg0bRnBwMAsXLqRc0aIYPO054OfwECiCrtDFfiCU\njIVKABgxIstt+/bty9ixY6latSouLi4cP34cR0dH2rVrx2effcbPP/9M9+7dAd20i5aWllSpUiXL\nfaWkpHDmzBnCw8M5cuQI4eHhhIeHA/DWW29RtWpVqlevjru7O1FRUURERLBy5UoMDQ1xd3fHzc2N\nJk2a8NFHH1G1alUsnvMZ6FxVuzasWqWrgb5oERw/DtHRYGsLbm4QGAjPUXbSyMiIgIAAevTowerV\nq5k0aRJJSUlMmTKFqKgomjZtSqNGjRg7dizu7u6v7LTyOnd3d3bt2kXz5s25f/8+w4cPx8jICC8v\nLzZv3vxGfzYFmUrObxh/f39atGjB9evX6dixI2PGjMHCwoL58+fzwQcfcPbsWczNzWnYsCGNGjXK\n0T7Pnz+Pk5MTc+fOZd26dRQqVIh+/foxZ84cDDp3htWr/3Pc3wKfAh8AjdFVp7qfttDMTFeLu3bt\nLLf95JNPSEhIoEWLFty5c4fKlSuzevVq7Ozs2LJlC5988gmffPIJWq2W6tWrM3PmTAAeP37MsWPH\n9Ak4PDyciIgISpYsSfXq1SldujS1a9emWrVqXLhwgYiICPbs2UOVKlVwc3PD3d2djh074u7uTvHi\nxf/zZ5Bn2NvD8OHPXi+HDAwM8PX1xcfHh02bNjFp0iRu3rzJuHHjiI2NpWXLlrz99tuMHTuWmjVr\nvrTj5icuLi7s3buX5s2bEx0dzaRJkzAyMqJFixZs2rSJGjVq5HaIykumEXniIVSlwCpbtiwLFizA\ny8vrP+/r5s2brFixgtDQUC5cuEDXrl3x9/fnnXfeyVg168AB3QxTjx//52NmotHonhGePv2pzwbn\nRFRUlD4Bp7WISYOQzgAAIABJREFUL1++TJUqVahcuTJFihQBIDo6mtOnT3Pq1CmKFy+uT8Jp/7q4\nuOS5MpH50e7du5k0aRInT57ko48+QkT4+uuvqVmzJmPHjn3uiTMKijt37tCqVSvq1q3L3LlzWb16\nNYMHD2bDhg3UqlUrt8NTXiKVnN8g/zU5P3jwgF9//ZXQ0FAOHjxIhw4d8PPzo1mzZhgbG2e/4Xff\nwbBhz5egTU2hShU4fVqXhOPi/l1mbq6709mmDYwcmW2LOStarZYLFy5k6JIODw8nLi4Od3d3SpUq\nhbm5OQkJCVy7do0TJ06QkJCQIQG7ublRrVq1HHX5K//NgQMHmDx5Mvv27WPQoEEUKlSIr7/+mmrV\nqjFu3Djeeeed3A7xtYuJiaF9+/aUKlWKRYsWsWHDBvr3789vv/32xl60FEQqOb9BXiQ5x8fHs2HD\nBkJDQ9m2bRtNmzbF39+ftm3bPt/90rQEHZc6pCs7T7aGU+9vrhg3jg4eHpiVKJHj+5vx8fGcOHEi\nQ4v42LFjFClShAoVKlC0aFE0Gg0PHjzg3LlzXLlyhQoVKmRqDTs6Oj69hrbyykVERDBlyhQ2b97M\n+++/T9GiRZkzZw4VKlRg3LhxeHh45HaIr1VcXBxdunTBwMCA5cuXs337dvr06cPatWvfyAuWgkgl\nZyWT5ORkduzYQWhoKGvWrKFmzZr4+/vj4+ODra3ti+/44EHdfM4bNz53a7hEiRIcOXKEkiVLZrnr\ne/fucfTo0Qwt4nPnzuHs7Ezp0qWxsLAgKSmJmzdv8s8//2BjY5OpNVypUiVMTExe/PyUV+7cuXNM\nmzaNlStX0qtXL0qXLs0333yDk5MT48aNw9PT8425kEpKSiIwMJBr166xbt06wsLCePfdd/n1119p\n2LBhboen/EcqOSsAiAj79+8nNDSU5cuXU7p0afz9/enWrRsODg4v92AvMNrXwcGBgwcPUrJkSS5f\nvpyhS/rIkSNER0fj4uJC0aJFMTQ0JCYmhsuXL/PgwQPc3NwyJGE3N7f/dpGh5LrIyEimT59OcHAw\nnTt3pmLFisybN4+SJUsybtw4mjVr9kYkaa1Wy+DBgzl48CC///47hw8fpmfPnvzyyy80btw4t8NT\n/gOVnN9wJ0+eJDQ0lKVLl2JkZESPHj3w8/OjQoUKuR0aSUlJnDp1ivDwcAYPHky1atU4ffo0pqam\nlC5dGisrK5KSkrh16xZXrlzB2dk5U2vYycnpmVM/KvlXVFQUX3/9NfPmzaNNmza4u7uzcOFCbG1t\nGTduHC1btizwSVpEGD16NGvWrGHr1q38888/dOvWjeXLl9O0adPcDk95QSo5v4GuXLnCsmXLCA0N\n5fbt2/j5+eHv789bb72Va3/IYmJiOHr0aIbW8OnTpylevDj29vYcPXqUsmXLcvPmTSwsLDK1hqtU\nqfLcs04pBcf9+/eZO3cus2fPxsPDgzp16hASEoKFhQXjxo2jbdu2BT5JT5s2je+//56tW7cSGRlJ\nly5dWLJkCc2bN8/t0JQXoJLzG+LOnTusXLmS0NBQTpw4ga+vL/7+/nh4eGBoaPja4hARrl+/numx\npevXr+Po6IiVlRUpKSncvn2b+/fv4+rqiru7O6tXr+abb77By8sL++codKG8WWJjY5k/fz7Tp0/H\n3d2dhg0bsmLFCgwNDRk3bhwdOnQo0D0pP/zwA59//jm///47Dx48wMfHh+DgYFq1apXboSnPSSXn\nAiw2NpZ169YRGhrKnj17aNOmDX5+frRs2RJTU9NXfvy0alrpB2kdPnyY5ORkihcvjrGxMbGxsdy8\neRNHR0eqV6+eoTVcvnx5/YWDs7Mzf/zxB87Ozq88biX/S0hIYNGiRXzxxReULl2apk2bsm7dOpKT\nkxk7diw+Pj4FNkkvX76cIUOGsHbtWkSEjh07snDhQtq1a5fboSnPQSXnAiYxMZEtW7YQGhrKxo0b\nadCgAf7+/nTs2BFLS8tXdtwnq2kdOnSIiIgIrK2tsba2RqvVcufOHQwMDKhevXqGROzq6kqhQoWe\nuv9y5cqxdetWypcv/8rOQSl4kpOTWbp0KVOmTKFQoUK0atWKzZs38+jRI8aOHUuXLl1ea8/R67Jx\n40YCAwMJDQ3F2tqa9u3b88MPP9CxY8fcDk3JIZWcCwCtVsuePXsIDQ1l1apVVKlSBX9/fzp37vxK\nuoDTqmkdOXKEI0eOcODAASIjI7Gzs8PU1JRHjx7x4MEDKlWqRI0aNTK0hkuWLPlC9/5cXFzYtGkT\nLi4uL/18lIJPq9Xq63cnJibSrl07du3aRXR0NGPGjKF79+4FrrLbnj178PX1Zd68eZQpU4a2bdvy\nzTff4Ovrm9uhKTmgknM+JSKEh4cTGhrKsmXLsLOzw8/Pj+7du+Pk5JSjfaR1O1taWlK6dOlMy5+s\nprV//36OHDlCXFwcNjY2aLVaoqOjsbOz46233sqQiCtUqPD0qmHPqWLFiqxfv56KFSu+tH0qbx4R\n0dfvvnHjBp06dWL//v3cvHmT0aNH06NHj5f6e5vbDh8+TNu2bZk6dSrVq1enVatWzJ49m65du+Z2\naMozqOScz5w7d46lS5cSGhpKQkIC/v7++Pn54erq+tTtHj16xPHjxzly5Ah79+7l4MGDXLx4kaSk\nJDp16sTSpUv11bQOHjzIX3/9xenTpzExMcHMzIzHjx+TkpJC1apVqVOnDu7u7ri7u1OtWjVsbGxe\n+XlXqlSJtWvXUrly5Vd+LOXNkL5+d6dOnTh27BhXr15l1KhR9OrVq8AUpDl9+jQtWrRg2LBheHp6\n0rJlS2bMmIG/v39uh6Y8hUrOeUxycjLJycmYmZnp37tx4wbLly9n6dKlXLp0iW7duuHv70+9evWy\n7CJO63bet28fe/fuJSIiglu3bpHdj9rQ0BADAwN9Oc5Hjx5RqlQpatasSe3atfWt4dKlS+fa4yhV\nqlTh119/zXYqR0V5Uenrd3fo0IFz585x/vx5Ro4cSe/evV/L4MlX7fLlyzRv3pwePXrg6+tLixYt\nmDp1Kr169crt0JRsFKybLK9bVJSu0tWxY/DgAdjYgLs79O79XPPaPlmda+zYsfTo0UM/ycShQ4fo\n2LEjEyZMoGnTpvp7Y1qtlnPnznHo0CF27NjB/v37OXfuHLGxsc91GlqtliFDhvDWW2/h7u5O5cqV\n89wfJAMDA7RabW6HoRRAderUYfXq1fr63ceOHaN9+/asXLmSSZMmMWLECPr27Zvhgjm/cXJyYs+e\nPbRs2ZL79++zdetWWrZsSXJyMn369Mnt8JSsiPL89u8X8fYWMTPTvXRVoXUvc3Pde97euvWe4sSJ\nEzJ69GgpV66cAPpXkSJFxNraWnx8fGTlypXy+PFjiYuLkwMHDsj06dOlffv2UrZsWTEyMsqw3Yu+\nDAwM5NGjR6/pw3sxrq6ucuzYsdwOQ3kDnD17Vvr27Su2trbi7+8vzZs3FwcHB/nqq6/y/P+TZ4mO\njpb69etLYGCgnDhxQkqVKiXz5s3L7bCULKhu7ef1orMrpUpfnevo0aPZbj5nzhzOnTvH/v37OXPm\nDPfu3cu2W/p5mZiYUK5cOWrVqsXbb7+Nu7s7DRo0yNOPlLi7uxMSEoK7u3tuh6K8IdLX727WrBkx\nMTEcO3aMTz/9lIEDBz7z8b+86tGjR/j4+GBpacmECRNo3bo1I0aMYNCgQbkdmpKOSs7P40XmJbaw\n4OH48SyxstIXA3mdihcvTtWqValfvz5169bNt/Wma9SowaJFi6hRo0Zuh6K8YdLX727QoAFJSUkc\nPnyYoUOHMnjw4Hw5r3dCQgI9evQgJiaGmTNn0r59e4YOHcqQIUNyOzQlVf76C/2EBQsW4OLigqWl\nJa1ateL69ev6ZV9++SXVqlXDysoKZ2dnvvzyy2z3k5iYSOfOnSlbtiwajYadO3dmWufwzz/T6IMP\nsHz8mOLArHTLwgEPwAYoBXyefsPHjzH4v/9jwcCBrzQxazQa7Ozs6NGjBwsWLGDfvn306tULU1NT\nDhw4wIYNGzA2NsbZ2TnfJWbQnZ+656zkhmLFijF58mTOnz9P3bp1OXToENWrV2fXrl2UK1eOiRMn\n8uDBg9wO87mYmpqybNkySpcuzfvvv8/atWuZNWsWM2fOzO3QlFT57690ql27djFq1CjWrl3LvXv3\ncHZ2xs/PT79cRAgODiY6OppNmzYxd+5cli1blu3+GjZsSEhICCVKlMi07M6dO7Tq25f+Wi13gXNA\ni3TL/YFGwD1gF/AdsC7dcjNg5H841/QMDAxwcHCgadOmtG7dmpkzZ3L16lWuXr2Kk5MT1apV4733\n3sPNzQ1nZ2d27drFgwcPmDBhAl27duXSpUsvKZLXy8DA4KV16yvKiyhcuDBjxozhwoULtGrVimPH\njlGlShX27t1L+fLlGT9+PNHR0bkdZo4ZGRmxYMEC6tevT0BAACtWrODbb7/liy++yO3QFMi/A8I+\n/fRTGTRokP77a9euCSDnzp3Lcv0PP/xQPvjgg2fu19HRUXbs2JHhvZFDhkhPA4OMA7/SvcxBTqT7\nvjPI5CfWeQxS9DkHallaWkq1atUkICBAKlSoIFOmTJHk5ORsY58xY4a0a9cu2+Vubm6ycuXKZ34G\neVHt2rVl/zMG2CnK6xQXFyfff/+9ODs7S926daVly5ZiZ2cnY8aMkTt37uR2eDmm1WplwoQJ4uLi\nIvv27ZOKFSvKxIkTczusN16+bTmLSIaWVNrXERERWa67Z8+eZxbqyM5fGzZQRKOhPlAMaA9cSbf8\nYyAYSAL+AfYBXk/GALybzf4NDQ1xdHSkWbNmjBkzhl27dvHw4UMePnzI8ePHCQ4OplixYpQoUeKp\ng7Z2796d7TneunWLM2fOvPBnkNtUt7aS15iZmdG/f3/OnDnDBx98wJUrV3BwcODvv/+mYsWKjBw5\nktu3b+d2mM+k0WgYM2YMQ4YMoWvXrsyfP5+QkBD+97//qd6q3JSrlwb/wbZt28TOzk6OHj0qjx8/\nln79+olGo5HQ0NBM644bN07c3d0lPj7+mfvNquVcwcpKbED2g8SBfAhSP12rOAykPIhhaot3XDYt\n7MUgVlZWUq1aNenZs6dUrlxZhg4dKlqt9plxNWjQQH766adsly9cuFAcHR3l9u3bmZYlJiZKs2bN\npF+/fs88Tl5Vr1492bdvX26HoSjZSklJkZUrV8pbb70lFStWFC8vL7G1tZVhw4bJzZs3czu8HFm8\neLGUKFFCNm/eLK6urjJmzJgc/X1SXr58m5xFRObOnSsuLi5ib28vkydPFmtra9m9e3eGdebMmSNl\ny5aVq1ev5mifWSVndysrCUyXZO+kJuH7IHdBrFITbxLIVZB6IN9kkZxT2rbV7/PKlStiaGgo58+f\nz1FcT0vOq1evlmLFimX5HHBKSop069ZNWrduLYmJiTk6Vl70zjvvSFhYWG6HoSjPpNVqZePGjdKg\nQQNxcnKSpk2biq2trXz88cdy7dq13A7vmdasWSP29vaydu1acXNzkxEjRqgEnQvybbc2wODBgzl7\n9ixRUVH4+vqSnJxMtWrV9MsXLlzI1KlT2b59O6VKlXrh47jb2ZG+aGXa1wJcAAyBXujKrZUCugMb\ns9iPQZEi+q+Dg4OpX78+5cqVe+G4ADZt2sT777/Pb7/9hpubW4ZlIsJ7773HrVu3WLVqVb4u6K+6\ntZX8QqPR0Lp1a/bu3UtwcDBGRkaYmZkRHh5OtWrV+PDDD4mMjMztMLPVsWNHli5dSt++ffnss8/Y\nvHkzw4cPV13cr1m+TM7JycnEx8cTERGBiHDlyhX69evHRx99hK2tLQBLlixh1KhRbN26NUcJMCEh\ngfj4eED3aFV8fLz+l7F38+asRvfIVBIwAWgIFAYqokvSoYAWuAksB6o/eQBzc0iXPIODgwkMDHxm\nXOljSUpKIj4+Xp+k/vjjD3r06MGqVauoW7dupm0HDhzIqVOn+O233zA3N3/msfIyNVpbyY8aNWrE\n5s2bWbt2LYULF8bQ0JBjx47h5ubGwIEDuXz5cm6HmKVmzZrx22+/8cknnzBo0CB27tzJ0KFD1f/B\n1ykXW+0vLCgoSKKjo8XNzU0sLCykePHi8tlnn2UYyZxW3rJQoUL6V//+/fXLq1atKiEhIfrvnZyc\nMo2Wvnjxom7hrVvyrZGROIAUBmkHciVdd/V2kNog1iDFQfqCPEpddhmkEMhlU1ORqCgREfnzzz/F\nwsJCYmJiMp1bq1atZNKkSfrvGzdunCmutG53T09PMTQ0zHCOrVq1EhGRS5cuCSCmpqYZlqc/5/yk\nUaNGsnPnztwOQ1H+k+PHj4u/v7/Y2tpKgwYNxNbWVvr27Zvj21uv2/Hjx8XR0VFmzJghdevWlUGD\nBklKSkpuh/VGUBXCcsrHB9aseXrJzuxoNODtDatWvfy43hCenp4EBQXRpEmT3A5FUf6zc+fO8cUX\nX/DLL79QuXJlzpw5Q8eOHRk1ahQVKlTI7fAyOH/+PM2bN6dXr15s2bIFNzc3vvvuu3xZzCg/UZ9u\nTo0cqeuafhHm5rrtlRemurWVgsTFxYX58+dz/Phx6tWrh1arJSIignr16hEQEMDp06dzO0S98uXL\ns3fvXn755Rfq1avHyZMnef/999UYkFdMJeecqlNHN4lF6pzHOWZhoduudu1XE9cbQg0IUwqi0qVL\nM2vWLM6cOUPz5s0RESIiImjQoAF+fn6cOHEit0MEwMHBgd27dxMWFkbFihU5f/48vXv3JiUlJbdD\nK7BUcn4eAwf+m6A1mqevq9H8m5jTzUqlvBjVclYKsrT63RcvXsTX1xeNRkNERASNGjWiS5cuHDt2\nLLdDxM7Oju3bt3Px4kXs7e2JjIykV69eJCcn53ZoBZJKzs9r4EDYtUt3D9nMLHNXt7m57n1vb916\nKjG/FAYGBqrlrBR4afW7L126RO/evTExMSEiIoKmTZvi7e3N4cOHczU+KysrNm7cSGJiIsbGxty6\ndYuePXuSlJSUq3EVRGpA2H9x+zYsWgTHj0N0NNja6h6XCgwEe/vcjq5AadWqFR999BGtW7fO7VAU\n5bWJj49n0aJFTJkyBWNjY+7fv88777zD2LFjs3x88nVJSkqid+/eXLp0CQsLC6ytrVm6dGm+rqWQ\n16jkrOQLbdq04YMPPqBNmza5HYqivHZJSUksW7aMSZMmERcXx6NHj6hduzZBQUG88847uRKTVqtl\nyJAhhIWFUbx4cczNzVm+fDkmJia5Ek9Bo7q1lXxBdWsrbzJjY2MCAgI4efIkM2fOpFSpUhw/fpwO\nHTrg5eX1SueKz46BgQFz5syhbdu2XLp0ibi4OHx9fUlISHjtsRREKjkr+YIara0ouoTo6+vLkSNH\nWLBgARUqVOD48eP4+Pjg6enJjh07XuvASY1Gw8SJE3n//fc5ffo0ycnJeHt766stKi9OJWclX1Cj\ntRXlX2n1u8PCwlixYgU1atTg2LFjdO3aFQ8PD7Zt2/Za/798+umnjBkzhqNHjyIidOjQgbi4uNd2\n/IJIJWclX1Dd2oqSmUajoXHjxmzdupXNmzdTv359jh8/jr+/P2+//TabNm16bUm6b9++zJo1i0OH\nDqHRaGjXrh2PHj16LccuiFRyVvIF1a2tKE9Xp04d1q5dS1hYGM2aNePkyZP06tWLWrVqsX79+teS\npLt06UJwcDCHDx/G0NCQtm3bEhsb+8qPWxCp5KzkC6pbW1Fyplq1aixdupQjR47QoUMHzpw5Q58+\nfXB3d2fNmjWv/CK3VatWrF69mvDwcIyMjGjdujUPHz58pccsiFRyVvIF1a2tKM/HxcWFBQsWcOrU\nKbp3787Fixd5//33cXV1ZeXKla/0/1PDhg3ZsmULJ06cwMjIiBYtWvDgwYNXdryCSCVnJV9Q3dqK\n8mJKly7N7NmzuXDhAn379iUyMpIBAwZQsWJFli1b9srqY9eoUYOdO3dy/vx5DA0Nad68Offv338l\nxyqIVHJW8gXVra0o/02xYsWYMmUKV69e5aOPPuLOnTsMHjwYFxcXQkJCXkmN7EqVKrF3716ioqLQ\naDQ0a9aMe/fuvfTjFEQqOSv5gurWVpSXo3DhwowdO5bIyEhGjRrFw4cPGTJkCM7OzixatOil18ku\nU6YMe/fuJSEhARGhWbNmrF+/nk6dOnHu3LmXeqyCRCVnJV9Q3dqK8nJZWlry6aefEhkZyeTJk0lK\nSmLo0KGUKVOG+fPnk5iY+NKOVaxYMXbu3Im5uTkPHjygffv2rF27lkaNGnHmzJmXdpyCRCVnJV9Q\n3dqK8mqYmZkxYMAArl69yqxZszAxMWHYsGGUKlWKb7/99qWV4yxcuDAzZszg0qVL+vdu3LiBh4cH\np06deinHKEhUclbyBdWtrSivlrGxMb169eLixYssXLgQW1tbRowYgYODA7Nnz85QkvNFi4tMnTo1\n00V2VFQUjRo14sSJE/8p/oJGJWclX1Dd2oryeqTV7z59+jQrVqygVKlSjBw5kpIlSzJ9+nSioqIo\nWbIknTp14p9//nmufS9evJiGDRtmev/OnTt4eHhw7Nixl3Ua+Z5Kzkq+oLq1FeX1SqvfHR4ezsaN\nG6lUqRLjxo2jdOnSPHz4kLVr11K5cmXatGnDyZMnc7RPGxsbNm/enOW87NHR0TRq1IgjR4687FPJ\nl1RyVvIF1a2tKLkjrX73X3/9xebNmzON5v79999xdXXFy8srRy1fCwsL1qxZQ7du3TIte/DgAY0b\nN+bQoUMvLf78SiVnJV9Q3dqKkvtiY2Oz7cHavn071atXp1GjRhw+fPip+zExMWHJkiX069cv07KH\nDx/SuHFj9u/f/1Jizq9UclbyBdWtrSi5r3nz5oSEhFC6dOls19mzZw+1atWiXr16T02whoaGfP/9\n9/zf//1fpmWPHj3C09OTffv2vZS48yOVnJV8QXVrK0ruMzIyokePHly6dIlff/2V8uXLZ7vu/v37\nqVevHjVr1iQsLCzLdTQaDV988QWTJ0/OtCwuLo4mTZqwd+/elxZ/fqKSs5IvqG5tRck7DAwM8Pb2\n5uzZs2zevBlXV9ds1z1y5AgNGzakWrVq7Ny5M8t1Ro4cybfffpvp/YSEBJo1a8auXbteVuj5hkrO\nSr6gurUVJe/RaDS0aNGCiIgIfXd2dk6cOEGTJk2oVKkSW7ZsybR84MCBhIaGYmCQMS0lJibi5eXF\ntm3bXnr8eZlKzkq+oLq1FSVva9iwIQcPHuTQoUNZPsuc5syZM7Rs2ZLy5cuzfv36DBfdfn5+rFu3\nDiMjowzbJCcn06pVK37//fdXFn9eo5Kzki+obm1FyR9q1qzJnj17OHHiBM2bN892vQsXLtC+fXuc\nnJxYuXKlPkm3bduWbdu2YWpqmmH9lJQU2rVrx7p1615p/HmFSs5KvqC6tRUlf6latSpbtmzhwoUL\ndOjQAY1Gk+V6V69epUuXLjg6OhISEoKI0LhxY8LCwrCwsMiwrlarxdvbm5UrV76OU8hVKjkr+YLq\n1laU/MnZ2Zm1a9cSGRlJt27dMt1TTnPjxg0CAgIoXrw4P/74IzVr1uTgwYPY2NhkWE+r1dK1a1dC\nQkJeR/i5RiVnJV9Q3dqKkr85ODiwbNkybt26Re/evTPdV05z+/Zt+vbtS9GiRdm+fTuHDx/G3t4+\nwzoiQkBAAAsXLnwdoecKlZyVfEF1aytKwVC0aFEWLlzI3bt3GTx4MCYmJlmud+/ePT788ENq1qzJ\ngAEDcHR0zLTOe++9l/ERrKgomDYNevaE9u11/06bBrdvv6rTeWU0ov7iKfnAZ599ho2NDSNHjszt\nUBRFeYkeP37M+PHjmTt3LnFxcdmuV6hQIUxMTIiOjs607OchQ+h59SqkjeZON70l5uYgAq1bw8iR\nUKfOyz6FV0K1nJV8QbWcFaVgsrCwYNq0ady/f5+goCAKFSqU5XqPHj0iOjo608Cy/oD37Nlo16zR\nJeX0iRkgLk733po14OkJ3333ak7kJVPJWckX1IAwRSnYTExMGD9+PPfv32fatGmZBoKlSX+R3h+Y\nARQCDJ518S4Cjx/DsGH5IkGr5KzkC2pAmKK8GYyMjBg+fDj37t3jm2++wc7OLsv1avNvYn4uaQn6\n4MH/GOmrpZKzki+obm1FyRvmzp1L7dq1MTU1JTAwUP/+kiVLsLS01L8sLCzQaDT6uZm//PJLqlWr\nhpWVFc7Oznz55ZfZHuOvv/6iZcuWjBkzBo1GQ+3atTON2I4AigOWgAnglt2+gOZAEcAe6ALcePwY\npkwB4Ouvv6ZcuXJYW1vj4ODA0KFDSU5OBiAqKgo/Pz8cHBywsbGhQYMG/P3339nG/axzvHTpUrbb\nPkklZyVfUN3aipI3ODg4MGbMGPr06ZPh/R49ehAbG6t/ffvtt5QrV46aNWsCuu7o4OBgoqOj2bRp\nE3PnzmXZsmVZHiM6Opp+/fpx6dIlLl++jJubGzVr1mTFihWULl0ae+AeEJv6qo8u6Wa5L6AfcAm4\nDFgBvQE2boTbt2nfvj2HDx8mJiaGiIgIjh49yuzZswHd/NV16tTh0KFD3Lt3j3fffZe2bdsSGxub\n5bGedY5+fn7P/oBTqdHaSp63e/dufvrpJ5KTkwkMDKRJkybZFjJQFOX1GDNmDJGRkSxatCjL5U2a\nNMHT05OgoKAslw8ZMgQRYc6cOc881uHDh2ncuDEPHz4E4FSfPpRdtAhzES4B5YFzgHMO4j4MNAYe\nmpvD//4Hw4frl929e5du3bpRsWLFLGfJArC2tmbHjh1PneQjTfpzPHPmDG5ubiQkJOQgStVyVvKB\nZs2asWjRIkJCQvDy8iIlJSW3Q1IU5SkuX77M7t276dWrV5bLRYQ9e/Y8darJ9Hbv3p1h3SqJiZin\ntiuDAQ9ylpgBdgOuoBvFffw4AKGhoVhbW1O0aFGOHj1K//79s9w2PDycxMREXFxcnnmcJ8/xxIkT\nlCtXLodll/euAAAJ90lEQVRRquSs5ANPPjqhurcVJW8LDg7Gw8MDZ+esU+b48ePRarX07t37mfs6\nduwYn3/+ecb7tw8e/HssIDCHcR0DPgf0e0p9Ztrf35+YmBjOnDnDgAEDKF68eKZtY2JiCAgIICgo\nKNuR5Ok9eY6xsbE52i6NSs5KnvdkF7a6E6MoeVtwcDDvvvtulsvmzp1LcHAwGzZsyDTz1JPOnTtH\n69atmTVrFh4eHv8uSE1ye4GbQOccxHQOaA3MQtfSBsDWNsM6FSpUwNXVlUGDBmV4Py4ujvbt2/P2\n22/nqBBSVudoaWlJTExMDiLVUclZyfNUy1lR8o+wsDCuX79O586ZU+bChQuZOnUq27dvp1SpUk/d\nz+XLl/Hy8mLs2LEEBARkXOjuDmZmLAZ80I3Yfuq+AC9gLKDfk7k5uGUe452cnMz58+f13yckJNCp\nUyccHR2ZN2/eM46U/Tm6urpy4cKFZ26fRiVnJc9TLWdFyTuSk5OJj48nJSWFlJQU4uPj9Y8eASxe\nvBhfX1+srKwybLdkyRJGjRrF1q1bn3nv9dq1azRt2pTBgwczYMCAzCsEBhInwi88u0v7GtAUGAxk\n2JMIBAayYMECoqKiADh58iRTpkyhWbNmACQlJdG5c2fMzc0JDg5+5kDUp51jxYoVqVGjxjOizRCf\nouRtlpaWAuhfMTExuR2SoryxgoKCMvx/BCQoKEhEROLi4sTGxka2bduWabuyZcuKkZGRFCpUSP/q\n37+/fnnVqlUlJCRERETGjx8vQIZ1CxUqlGF/obVrSxkQrS7NZnhVBQlJ/Xp8aoyFnniJj4+IiAQG\nBkqxYsXEwsJCnJycZNiwYRIXFyciIjt37hRAzM3NM8Sxe/duERHZvXt3hriedY4XL17M8eesHqVS\n8jxra2v9IxQA9+/ff66BFYqiFEAHDuhqZT9+/PzbWljArl1Qu/ZLD+tlUd3aSp6nurUVRcmkTh2Y\nPl2XaJ+HhYVuuzycmAGynu1aUfKQJ5OzGhCmKAoAAwfq/h02TPfc8tMu3DUa3SCw6dP/3S4PUy1n\nJc9To7UVRcnWwIG6LmpvbzAz0yXg9MzNde97e+vWyweJGVT5TiUfsLe3586dO/rvo6KiMhXBVxRF\n4fZtWLRIV/krOlr3HLObGwQGQj77m6GSs5LnFS9eXP+oA8DNmzezrOCjKIpSUKhubSXPU93aiqK8\naVRyVvI8NVpbUZQ3jUrOSp6nWs6KorxpVHJW8jzVclYU5U2jkrOSt0VFMfDhQ4KBdeimh7P89lvd\nqExFUZQCSo3WVvKmAwdgyhT4/Xfi4uNJ/+Si1sxMd1XZujWMHKmrFKQoilKAqOSs5D3ffVcgK/4o\niqLklOrWVvKWtMT8+DGIcAnQAMlZrSuiW2/YMN12iqIoBYRqOSt5RxazzFwCnIEknlEIPh/MMqMo\nipJTquWs5B1Tpui6sl9EXJxue0VRlAJAJWflhV2/fh1fX1/s7e1xdnZm9uzZAIwfP54uXbrQs2dP\nrKyscHNz48yZM0yZMoVixYpRunRptmzZot+Pp6cnI4cMoe6aNdiI0BG4l90xgQ5Akf9v7/5CqsoT\nAI5/x4vDXknTUBBbUWEhgoa2YC7LLpJEIg3FItSmplOQYPSwPfQgblDuS24wDzLT2zLhbEVt7Ygo\nFBU9RZBYETuVzg2C68x1F2UxqbaNm7oPx7nVDM5sd5zpx87383Q99/x/+Xr+3HOAXwB/Xhj+z/l5\nCvr7+dfnn2fHvXnzJmVlZWQyGQCOHz/O6tWrKSkpoaGhgVQqlR13bGyM+vp6VqxYwapVqzh79uxS\n7SZJem3GWTmZm5tj69atrF27lnQ6zZUrV+jt7eXixYsADA0N0dbWxvT0NOvWraOhoYG5uTnS6TSH\nDh2io6Pjlfn95ZNPOJ6fzwTR6evfL7LcZuDnRJH+G/AH4ApQDtTl5XG2qys77smTJ2lqaiI/P5+B\ngQGOHDlCf38/U1NT1NbW0tzcDMCTJ0+or6+npaWFyclJTp8+zb59+7h79+5S7jJJ+p95zVk5GR4e\nZvv27YyPj2eH9fT0kEwmqaqq4tq1a1y+fBmIQt3c3MzMzAyxWIxHjx5RVFTE9PQ0xcXF1NXV8aup\nKf507x4A94BfAk+BL3hxzfkfQDXwEChcWGbXwvA+4K/Ah2VlXJucZHZ2lpUrVzI4OEgikWDz5s1s\n27aNPXv2ANE/F8uWLWN0dJTr169z7Ngxrl69mt2Wjo4OKioqOHz48A+0ByVpcd96j420mFQqxcTE\nBMXFxdlhs7Oz1NbWUlVV9cpbo+LxOKWlpcRisezfAI8fP85OX/nSU8CqiGL84iWRkQmi09mFLw2r\nAm4sfP4tsPfhQx48eEAymWT58uUkEons+u7fv58DBw5kp52fnyedTpNKpRgeHn5lW54/f05bW9vr\n7xhJWgLGWTmprKykpqaG+/fvf+O77u7u157fFy89L3scyAdKiY6cv1JBdC36ES8CPQ6sXPj8M+B3\n1dWcOnWKsbGxV+JaWVnJwYMH2blz5zeWnUql2LBhQ/ZIX5LeNK85KyeJRIKioiKOHj3K06dPmZ2d\n5c6dO4yMjOQ0v5Nffsm9t9/m38AhYBsQ+9o4lcCviU5l/wf4O/AxkM1tPM779fX09fUxODhIa2tr\ndtq9e/fS09OTvY48MzPDuXPnANiyZQvJZJITJ06QyWTIZDKMjIwwOjqa07ZI0vdlnJWTWCzG0NAQ\nt2/fpqamhtLSUtrb25mZmclpfm27drE7k6GcKLwfLjLeaaLfPlcAjcAfgfqvvpyf5zfd3eTl5bF+\n/Xqqq6uz0zU2NtLZ2UlTUxNFRUWsWbOGCxcuAFBYWMilS5c4c+YMFRUVlJeX09nZybNnz3LaFkn6\nvrwhTG9cXV0dra2ttJ8/DwMD3/7IzsW89RY0NsKnn7Jx40ZaWlpob29f+pWVpB+BR84KR1dX9Kzs\nXMTj0NXFyMgIt27dYseOHUu7bpL0IzLOCse770YvsSgoeL3pCgrggw/Y9dFHbNq0id7eXgoLC797\nOkkKlKe1FR7fSiXpJ844K0w3bkTPyj5/Porwy8/cjsejaL/3XnQq3JddSPo/Y5wVtqkp6OuDzz6D\n6WkoKYF33oHdu6Gs7E2vnST9IIyzJEmB8YYwSZICY5wlSQqMcZYkKTDGWZKkwBhnSZICY5wlSQqM\ncZYkKTDGWZKkwBhnSZICY5wlSQqMcZYkKTDGWZKkwBhnSZICY5wlSQqMcZYkKTDGWZKkwBhnSZIC\nY5wlSQqMcZYkKTDGWZKkwBhnSZICY5wlSQqMcZYkKTDGWZKkwBhnSZICY5wlSQqMcZYkKTDGWZKk\nwBhnSZICY5wlSQqMcZYkKTDGWZKkwBhnSZICY5wlSQqMcZYkKTDGWZKkwBhnSZICY5wlSQrMfwFD\nYVk69KzAtgAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7fc87632ee10>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from_ = edges_final.select('from_id').rdd.map(lambda row: row[0]).collect()\n",
    "to_ = edges_final.select('to_id').rdd.map(lambda row: row[0]).collect()\n",
    "\n",
    "# libraries\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import networkx as nx\n",
    "import matplotlib.pyplot as plt\n",
    " \n",
    "# Build a dataframe with 4 connections\n",
    "df = pd.DataFrame({ 'from': from_, 'to': to_})\n",
    "df\n",
    " \n",
    "# Build your graph\n",
    "G=nx.from_pandas_dataframe(df, 'from', 'to', create_using=nx.DiGraph())\n",
    " \n",
    "# Plot it\n",
    "nx.draw(G, with_labels=True)\n",
    "plt.show()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 269,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Transaction at 0x7fd558f00320>"
      ]
     },
     "execution_count": 269,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph(\"http://192.168.7.143:7474/db/data/\")\n",
    "\n",
    "# merge nodes and relationship\n",
    "# create Tom and Jerry as before\n",
    "u1 = Node(\"Person\",name='Tom',id=1)\n",
    "u2 = Node('Person', name='Jerry', id=2)\n",
    "\n",
    "# either use u1 and u2 directly\n",
    "u1_knows_u2 = Relationship(u1, 'KKNOWS', u2)\n",
    "graph.begin()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 278,
   "metadata": {},
   "outputs": [],
   "source": [
    "def importFromCSVtoNeo(graph):\n",
    "    query = \"MATCH (a {id: 21}),(b {id:14}) CREATE (a)-[r:tcp]->(b) RETURN a;\"\n",
    "    graph.run(query)\n",
    "importFromCSVtoNeo(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 297,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'admin': ['192.168.7.171', ' 192.168.7.130'],\n",
       " 'recruiter': ['/cgi-bin/register.py', ' /cgi-bin/course.py'],\n",
       " 'student': ['register', 'info'],\n",
       " 'teacher': ['eval', ' course']}"
      ]
     },
     "execution_count": 297,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# this block get label information from http request\n",
    "r = requests.get('http://192.168.7.143:8000/api/label/desc/')\n",
    "\n",
    "# Currently this is HARD CODED\n",
    "if read_label:\n",
    "    label_map = {}\n",
    "    for labeljson in r.json():\n",
    "        apps = labeljson['address'].split(',')\n",
    "        label_map[labeljson['roles']] = list(apps)\n",
    "    label_map\n",
    "label_map"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for new_ddn in label_map.keys():\n",
    "    print(new_ddn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def label_ddn_edge_from_app(cur_ddn, application):\n",
    "    for new_ddn in label_map.keys():\n",
    "        app_list = label_map[new_ddn]\n",
    "        if application in app_list:\n",
    "            return new_ddn\n",
    "    return cur_ddn\n",
    "label_ddn_edge_from_app_udf = udf(label_ddn_edge_from_app, StringType())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "edges_labeled = edges.withColumn('ddn_id', \n",
    "                                 label_ddn_edge_from_app_udf('ddn_id', \n",
    "                                                             'application'))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "app_node_labeled = app_node.drop('ddn_id')\\\n",
    "                           .join(edges_labeled, app_node.node_id == edges_labeled.from_id, 'left_outer')\\\n",
    "                           .select(node_schema)\n",
    "user_node_labeled = user_node.drop('ddn_id')\\\n",
    "                           .join(edges_labeled, user_node.node_id == edges_labeled.to_id, 'left_outer')\\\n",
    "                           .select(node_schema)\n",
    "db_node_labeled = db_node.drop('ddn_id')\\\n",
    "                           .join(edges_labeled, db_node.node_id == edges_labeled.to_id, 'left_outer')\\\n",
    "                           .select(node_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "node_labeled = app_node_labeled.union(user_node_labeled)\\\n",
    "                               .union(db_node_labeled)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "edges.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
